{
  "department": "Command",
  "exam": [
    {
      "scenario": "First Contact Decision",
      "summary": "Your ship encounters a pre-warp civilization broadcasting distress signals. A rescue would violate the Prime Directive.",
      "answers": [
        {
          "text": "Hold orbit and monitor the situation covertly while consulting Starfleet Command for further guidance.",
          "score": 9,
          "type": "best",
          "details": "Adheres to Starfleet regulations and demonstrates restraint, valuing cultural integrity above impulse."
        },
        {
          "text": "Dispatch a shuttle to assist and erase all traces of Federation presence afterward.",
          "score": 8,
          "type": "alternate",
          "details": "Shows compassion but risks cultural contamination; borderline justification under emergency aid clauses."
        },
        {
          "text": "Beam survivors aboard immediately. A moral duty outweighs the Prime Directive.",
          "score": 0,
          "type": "incorrect",
          "details": "Direct interference violates General Order 1 and could alter the species’ development irreversibly."
        }
      ]
    },
    {
      "scenario": "Crew Discipline",
      "summary": "A senior officer publicly challenges one of your commands during a tense mission.",
      "answers": [
        {
          "text": "Address the disagreement privately, reinforce the chain of command, and clarify your reasoning.",
          "score": 9,
          "type": "best",
          "details": "Balances authority with respect, preserving unity and professional integrity."
        },
        {
          "text": "Relieve the officer immediately to prevent further dissent.",
          "score": 8,
          "type": "alternate",
          "details": "Restores order quickly but damages trust and morale if context is ignored."
        },
        {
          "text": "Ignore the challenge and hope it resolves itself after the crisis.",
          "score": 0,
          "type": "incorrect",
          "details": "Avoidance signals weak leadership and invites confusion during command-critical moments."
        }
      ]
    },
    {
      "scenario": "Uncharted Phenomenon",
      "summary": "Sensors detect a massive energy anomaly blocking your route to a Federation colony in distress.",
      "answers": [
        {
          "text": "Initiate a cautious study of the anomaly and chart a safe passage before proceeding.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates prudence and scientific curiosity while maintaining mission focus."
        },
        {
          "text": "Order full impulse straight through the field to minimize delay.",
          "score": 0,
          "type": "incorrect",
          "details": "Reckless disregard for unknown hazards endangers the ship and crew."
        },
        {
          "text": "Send a probe first, analyze telemetry, then determine the safest course.",
          "score": 8,
          "type": "alternate",
          "details": "Sound method, though slower; shows good tactical judgment and data reliance."
        }
      ]
    },
    {
      "scenario": "Diplomatic Escort",
      "summary": "An ambassador aboard your ship demands you alter course to attend a non-authorized negotiation.",
      "answers": [
        {
          "text": "Respectfully decline and explain that deviation would violate mission parameters.",
          "score": 9,
          "type": "best",
          "details": "Places duty and Starfleet orders above politics while maintaining decorum."
        },
        {
          "text": "Alter course to accommodate the ambassador; diplomacy outweighs orders in this case.",
          "score": 0,
          "type": "incorrect",
          "details": "Compromises mission integrity and chain of command for political convenience."
        },
        {
          "text": "Contact Starfleet Command for direction before proceeding with any change.",
          "score": 8,
          "type": "alternate",
          "details": "Shows prudence and procedural awareness though delays mission progress."
        }
      ]
    },
    {
      "scenario": "Medical Emergency",
      "summary": "A contagion spreads aboard, incapacitating key personnel including your Chief Medical Officer.",
      "answers": [
        {
          "text": "Seal affected sections, delegate containment to science officers, and continue essential ship operations.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates calm crisis management and trust in departmental expertise."
        },
        {
          "text": "Suspend all operations and divert to the nearest starbase immediately.",
          "score": 8,
          "type": "alternate",
          "details": "Shows responsible caution though potentially jeopardizing the primary mission."
        },
        {
          "text": "Personally enter isolation to assist medical staff with treatment efforts.",
          "score": 0,
          "type": "incorrect",
          "details": "Neglects command responsibilities and endangers leadership continuity."
        }
      ]
    },
    {
      "scenario": "Prime Directive Challenge",
      "summary": "A primitive species faces extinction from a planetary disaster that your crew could easily prevent.",
      "answers": [
        {
          "text": "Seek legal precedent through Starfleet channels for minimal non-invasive intervention.",
          "score": 9,
          "type": "best",
          "details": "Shows ethical discipline and respect for Federation law under moral duress."
        },
        {
          "text": "Order the crew to proceed with rescue operations in defiance of General Order 1.",
          "score": 0,
          "type": "incorrect",
          "details": "Intentions aside, this would violate the Prime Directive and create political fallout."
        },
        {
          "text": "Simulate natural events to subtly reduce the catastrophe’s impact.",
          "score": 8,
          "type": "alternate",
          "details": "A creative loophole but still ethically ambiguous; risks discovery."
        }
      ]
    },
    {
      "scenario": "Hostile Encounter",
      "summary": "An unknown vessel powers weapons but ignores all hails.",
      "answers": [
        {
          "text": "Raise shields, maintain position, and continue attempts at communication.",
          "score": 9,
          "type": "best",
          "details": "Balances defense and diplomacy; textbook Starfleet protocol."
        },
        {
          "text": "Fire a warning shot to show strength and compel a response.",
          "score": 8,
          "type": "alternate",
          "details": "May force communication but risks escalation without cause."
        },
        {
          "text": "Order a full pre-emptive strike to neutralize the potential threat.",
          "score": 0,
          "type": "incorrect",
          "details": "Aggressive act violates Federation defense doctrine and could trigger war."
        }
      ]
    },
    {
      "scenario": "Command Transfer",
      "summary": "You’re critically injured and must determine whether to pass command to your XO or continue issuing orders.",
      "answers": [
        {
          "text": "Relinquish command formally and ensure continuity through the established chain.",
          "score": 9,
          "type": "best",
          "details": "Displays self-awareness and adherence to Starfleet operational structure."
        },
        {
          "text": "Attempt to retain control until the crisis concludes.",
          "score": 0,
          "type": "incorrect",
          "details": "Compromises decision quality and risks mission failure."
        },
        {
          "text": "Share authority with your XO until recovery is confirmed.",
          "score": 8,
          "type": "alternate",
          "details": "Collaborative but blurs clear command authority under pressure."
        }
      ]
    }
  ]
}
