{
  "department": "Diplomacy",
  "exam": [
    {
      "scenario": "Border Negotiation",
      "summary": "Two Federation allies claim the same dilithium-rich moon, and both demand your arbitration.",
      "answers": [
        {
          "text": "Facilitate a joint resource agreement and insist on scientific verification of both claims before settlement.",
          "score": 9,
          "type": "best",
          "details": "Balances equity with fact-finding, reinforcing Federation values of cooperation and evidence-based resolution."
        },
        {
          "text": "Award the moon to the technologically weaker ally to maintain balance of power.",
          "score": 8,
          "type": "alternate",
          "details": "Shows strategic compassion but risks setting precedent for political favoritism."
        },
        {
          "text": "Avoid involvement and declare the matter outside Federation jurisdiction.",
          "score": 0,
          "type": "incorrect",
          "details": "Evading responsibility undermines diplomatic credibility and trust."
        }
      ]
    },
    {
      "scenario": "Cultural Offense",
      "summary": "During a treaty dinner, your science officer accidentally violates a sacred custom of the host species.",
      "answers": [
        {
          "text": "Offer a sincere apology and allow the offended delegation to dictate an appropriate form of restitution.",
          "score": 9,
          "type": "best",
          "details": "Acknowledges accountability while showing humility—core Federation diplomatic practice."
        },
        {
          "text": "Defend your officer publicly, arguing that intent should outweigh misunderstanding.",
          "score": 8,
          "type": "alternate",
          "details": "Demonstrates loyalty but risks deepening cultural insult."
        },
        {
          "text": "Ignore the incident to avoid drawing attention.",
          "score": 0,
          "type": "incorrect",
          "details": "Dismissal of the offense signals arrogance and damages relations."
        }
      ]
    },
    {
      "scenario": "Hostage Situation",
      "summary": "Pirates seize a Federation freighter crew. The local government forbids any Starfleet intervention.",
      "answers": [
        {
          "text": "Open back-channel discussions with the local government while covertly preparing a humanitarian rescue option.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates balance between political respect and moral obligation."
        },
        {
          "text": "Threaten economic sanctions unless the hostages are released immediately.",
          "score": 8,
          "type": "alternate",
          "details": "Can yield results but risks long-term resentment and instability."
        },
        {
          "text": "Authorize armed extraction without notifying the government.",
          "score": 0,
          "type": "incorrect",
          "details": "Violates sovereignty and diplomatic protocol, endangering future negotiations."
        }
      ]
    },
    {
      "scenario": "Peace Conference Breakdown",
      "summary": "Negotiations between two rival species collapse when one delegation storms out.",
      "answers": [
        {
          "text": "Privately appeal to both parties’ mutual interests and propose informal dialogue in a neutral setting.",
          "score": 9,
          "type": "best",
          "details": "Uses tact and empathy to re-establish communication channels."
        },
        {
          "text": "Publicly reprimand the delegation that walked out to demonstrate firmness.",
          "score": 8,
          "type": "alternate",
          "details": "Projects authority but risks entrenching hostility."
        },
        {
          "text": "Terminate the conference and submit a negative report to Starfleet Command.",
          "score": 0,
          "type": "incorrect",
          "details": "Ends any chance of reconciliation and wastes invested effort."
        }
      ]
    },
    {
      "scenario": "Intelligence Compromise",
      "summary": "You discover that one party in ongoing trade talks is using a covert surveillance device.",
      "answers": [
        {
          "text": "Pause negotiations, confront the offending party privately, and offer a path to resume with transparency.",
          "score": 9,
          "type": "best",
          "details": "Protects integrity while allowing de-escalation and recovery of trust."
        },
        {
          "text": "Expose the deception publicly before all delegates.",
          "score": 8,
          "type": "alternate",
          "details": "Satisfying but humiliates the offender, potentially collapsing the talks."
        },
        {
          "text": "Pretend ignorance and use the device to feed disinformation.",
          "score": 0,
          "type": "incorrect",
          "details": "Tactical gain undermines ethical credibility central to Federation diplomacy."
        }
      ]
    },
    {
      "scenario": "Refugee Dispute",
      "summary": "Two worlds refuse to accept refugees displaced by a supernova.",
      "answers": [
        {
          "text": "Negotiate a temporary shared-support plan with proportional aid commitments from each government.",
          "score": 9,
          "type": "best",
          "details": "Embodies Federation cooperation while mitigating humanitarian crisis."
        },
        {
          "text": "Transport all refugees to the nearest Federation starbase without approval.",
          "score": 0,
          "type": "incorrect",
          "details": "Violates jurisdiction and risks diplomatic backlash."
        },
        {
          "text": "Appeal to both worlds’ sense of interdependence and mutual defense treaties.",
          "score": 8,
          "type": "alternate",
          "details": "Persuasive and lawful though dependent on shared history of trust."
        }
      ]
    },
    {
      "scenario": "Aid Request",
      "summary": "A neutral world asks for advanced replicator technology to combat famine.",
      "answers": [
        {
          "text": "Offer humanitarian shipments but deny restricted technology transfer per Federation law.",
          "score": 9,
          "type": "best",
          "details": "Balances compassion with legal adherence to the Prime Directive and trade accords."
        },
        {
          "text": "Provide the technology quietly under diplomatic secrecy.",
          "score": 0,
          "type": "incorrect",
          "details": "Illegal transfer invites sanctions and political scandal."
        },
        {
          "text": "Petition the Federation Council for an exemption based on urgent humanitarian need.",
          "score": 8,
          "type": "alternate",
          "details": "Shows initiative and empathy while maintaining transparency."
        }
      ]
    },
    {
      "scenario": "Alliance Betrayal",
      "summary": "Evidence emerges that a long-time ally is supplying weapons to a hostile power.",
      "answers": [
        {
          "text": "Privately confront the ally’s leadership and present verified evidence before escalation.",
          "score": 9,
          "type": "best",
          "details": "Preserves dignity and allows redemption before punitive action."
        },
        {
          "text": "Suspend all treaties and issue a public condemnation immediately.",
          "score": 8,
          "type": "alternate",
          "details": "Displays decisive stance but eliminates diplomatic leverage."
        },
        {
          "text": "Ignore the intelligence until Starfleet orders intervention.",
          "score": 0,
          "type": "incorrect",
          "details": "Failure to act condones the betrayal and erodes trust across alliances."
        }
      ]
    }
  ]
}
