{
  "department": "Engineering",
  "study": [
    {
      "scenario": "Core Startup Drill",
      "summary": "Starfleet engineering cadets must demonstrate mastery of controlled warp core startup, balancing antimatter injection with magnetic constriction fields to safely achieve ignition.",
      "answers": [
        {
          "text": "Engage antimatter flow after diagnostic checks.",
          "score": 9,
          "type": "best",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities."
        },
        {
          "text": "Run partial test cycle before full ignition.",
          "score": 8,
          "type": "alternate",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Engage matter/antimatter injectors simultaneously.",
          "score": 3,
          "type": "alternate",
          "details": "Provides redundancy that ensures recovery if the first response fails. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Core Balancing Exercise",
      "summary": "Maintaining warp plasma balance requires precision in EPS flow regulation and field coil harmonics, preventing stress cascades across the system.",
      "answers": [
        {
          "text": "Adjust injectors gradually while monitoring readouts.",
          "score": 9,
          "type": "best",
          "details": "Provides redundancy that ensures recovery if the first response fails."
        },
        {
          "text": "Call for command to authorize manual override.",
          "score": 6,
          "type": "alternate",
          "details": "Balances EPS load to prevent cascading failures across multiple decks. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Overcompensate flow to reach balance faster.",
          "score": 5,
          "type": "alternate",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Core Monitoring Assignment",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Core Monitoring Assignment.",
      "answers": [
        {
          "text": "Track injector variance and report anomalies.",
          "score": 9,
          "type": "best",
          "details": "Maintains shield cohesion without overtaxing emitter relays."
        },
        {
          "text": "Simulate fault conditions to test monitoring.",
          "score": 7,
          "type": "alternate",
          "details": "Guards against equipment loss by containing hazards within forcefields. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Note only critical alerts for efficiency.",
          "score": 6,
          "type": "alternate",
          "details": "Prepares structural fields for sustained loads, preventing fatigue microfractures. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Core Shutdown Sequence",
      "summary": "Warp core shutdown drills emphasize staged antimatter cutoff, thermal bleed-off, and safing of magnetic containment to prevent destabilization.",
      "answers": [
        {
          "text": "Follow full shutdown checklist step by step.",
          "score": 9,
          "type": "best",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards."
        },
        {
          "text": "Deactivate injectors in reverse order.",
          "score": 7,
          "type": "alternate",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Shut down only primary injectors.",
          "score": 6,
          "type": "alternate",
          "details": "Provides redundancy that ensures recovery if the first response fails. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Core Drill Coordination",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Core Drill Coordination.",
      "answers": [
        {
          "text": "Synchronize output with helm for acceleration bursts.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises."
        },
        {
          "text": "Run at steady output regardless of helm requests.",
          "score": 4,
          "type": "alternate",
          "details": "Balances EPS load to prevent cascading failures across multiple decks. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Refuse coordination and log only readings.",
          "score": 3,
          "type": "alternate",
          "details": "Guards against equipment loss by containing hazards within forcefields. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Field Shaping Drill",
      "summary": "Shaping warp or structural fields involves precise modulation of graviton polarity and alignment, ensuring vessel stability under varying conditions.",
      "answers": [
        {
          "text": "Alter geometry for minimum drag through dense regions.",
          "score": 9,
          "type": "best",
          "details": "Provides redundancy that ensures recovery if the first response fails. (variation 2)"
        },
        {
          "text": "Request autopilot field configuration.",
          "score": 5,
          "type": "alternate",
          "details": "Contains faults before they can propagate into other subsystems. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Ignore helm input and adjust independently.",
          "score": 4,
          "type": "alternate",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Efficiency Optimization",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Efficiency Optimization.",
      "answers": [
        {
          "text": "Tighten field geometry to reduce waste.",
          "score": 9,
          "type": "best",
          "details": "Sustains mission effectiveness without sacrificing Federation principles."
        },
        {
          "text": "Balance efficiency against travel time.",
          "score": 8,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Shut down warp early to save resources.",
          "score": 6,
          "type": "alternate",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Course Correction Exercise",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Course Correction Exercise.",
      "answers": [
        {
          "text": "Adjust field coils in sync with navigational inputs.",
          "score": 9,
          "type": "best",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins."
        },
        {
          "text": "Ask command for permission to bypass coils.",
          "score": 6,
          "type": "alternate",
          "details": "Contains faults before they can propagate into other subsystems. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Overcompensate to test field limits.",
          "score": 5,
          "type": "alternate",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Efficiency Test Logging",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Efficiency Test Logging.",
      "answers": [
        {
          "text": "Log data precisely and suggest optimizations.",
          "score": 9,
          "type": "best",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices."
        },
        {
          "text": "Record only start and end points.",
          "score": 4,
          "type": "alternate",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Delegate to computer and skip logging.",
          "score": 3,
          "type": "alternate",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Instructor Challenge",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Challenge.",
      "answers": [
        {
          "text": "Continuously fine-tune geometry in sync with helm.",
          "score": 9,
          "type": "best",
          "details": "Contains faults before they can propagate into other subsystems."
        },
        {
          "text": "Overpower field coils for sharper turns.",
          "score": 4,
          "type": "alternate",
          "details": "Prioritizes survivability of the vessel above performance efficiency. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Hold geometry constant despite course changes.",
          "score": 3,
          "type": "alternate",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Rapid Shutdown Drill",
      "summary": "Warp core shutdown drills emphasize staged antimatter cutoff, thermal bleed-off, and safing of magnetic containment to prevent destabilization.",
      "answers": [
        {
          "text": "Follow emergency shutdown checklist exactly.",
          "score": 9,
          "type": "best",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions."
        },
        {
          "text": "Drop antimatter flow immediately to stop quickly.",
          "score": 7,
          "type": "alternate",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Delay shutdown until command confirms.",
          "score": 5,
          "type": "alternate",
          "details": "Maintains shield cohesion without overtaxing emitter relays. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Controlled Drop",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Controlled Drop.",
      "answers": [
        {
          "text": "Gradually reduce field strength per manual.",
          "score": 9,
          "type": "best",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure."
        },
        {
          "text": "Delegate exit to autopilot.",
          "score": 6,
          "type": "alternate",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Cut all power simultaneously.",
          "score": 3,
          "type": "alternate",
          "details": "Limits escalation of variance that can spiral into containment breach. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Team Coordination",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Team Coordination.",
      "answers": [
        {
          "text": "Synchronize shutdown timing with navigational input.",
          "score": 9,
          "type": "best",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records."
        },
        {
          "text": "Delay shutdown until after maneuver.",
          "score": 6,
          "type": "alternate",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Let computer decide optimal timing.",
          "score": 5,
          "type": "alternate",
          "details": "Limits escalation of variance that can spiral into containment breach. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Systems Lockdown Drill",
      "summary": "Computer system scenarios emphasize isolation of malfunctioning subroutines, protection of LCARS control, and restoration of ship automation.",
      "answers": [
        {
          "text": "Seal injectors and activate magnetic containment.",
          "score": 9,
          "type": "best",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. (variation 2)"
        },
        {
          "text": "Delegate security to engineering computer.",
          "score": 5,
          "type": "alternate",
          "details": "Draws directly on Academy lessons about redundancy and systemic caution. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Purge antimatter to space immediately.",
          "score": 4,
          "type": "alternate",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Instructor Review",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Review.",
      "answers": [
        {
          "text": "Follow full checklist quickly but accurately.",
          "score": 9,
          "type": "best",
          "details": "Reduces the chance of plasma instability while preserving mission tempo."
        },
        {
          "text": "Rely on computer automation.",
          "score": 6,
          "type": "alternate",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Skip steps to improve speed.",
          "score": 3,
          "type": "alternate",
          "details": "Provides redundancy that ensures recovery if the first response fails. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Mission Power Planning",
      "summary": "Power distribution training involves rerouting via EPS taps, balancing between primary systems, and avoiding overload of auxiliary relays.",
      "answers": [
        {
          "text": "Favor sensors and reroute from non-critical systems.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. (variation 2)"
        },
        {
          "text": "Cut replicators to boost propulsion.",
          "score": 8,
          "type": "alternate",
          "details": "Contains faults before they can propagate into other subsystems. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Balance evenly across all systems.",
          "score": 7,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Combat Distribution Drill",
      "summary": "Power distribution training involves rerouting via EPS taps, balancing between primary systems, and avoiding overload of auxiliary relays.",
      "answers": [
        {
          "text": "Prioritize shields and weapons.",
          "score": 9,
          "type": "best",
          "details": "Holds system integrity long enough for backup units to engage safely."
        },
        {
          "text": "Keep propulsion as top priority.",
          "score": 7,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Balance all systems equally.",
          "score": 6,
          "type": "alternate",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Survey Mission Allocation",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Survey Mission Allocation.",
      "answers": [
        {
          "text": "Prioritize sensors and lab modules.",
          "score": 9,
          "type": "best",
          "details": "Reduces feedback risk from EPS taps under high-current operation."
        },
        {
          "text": "Cut propulsion for maximum sensor output.",
          "score": 8,
          "type": "alternate",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Balance all ship functions.",
          "score": 7,
          "type": "alternate",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Adaptive Reallocation",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Adaptive Reallocation.",
      "answers": [
        {
          "text": "Shift from sensors to shields and weapons.",
          "score": 9,
          "type": "best",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards. (variation 2)"
        },
        {
          "text": "Ask bridge for confirmation before changing.",
          "score": 7,
          "type": "alternate",
          "details": "Balances EPS load to prevent cascading failures across multiple decks. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Cut all labs offline immediately.",
          "score": 6,
          "type": "alternate",
          "details": "Provides redundancy that ensures recovery if the first response fails. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Instructor Challenge",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Challenge.",
      "answers": [
        {
          "text": "Continuously adjust EPS allocations.",
          "score": 9,
          "type": "best",
          "details": "Holds system integrity long enough for backup units to engage safely. (variation 2)"
        },
        {
          "text": "Request assistance from senior officer.",
          "score": 7,
          "type": "alternate",
          "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Delegate to autopilot systems.",
          "score": 4,
          "type": "alternate",
          "details": "Balances EPS load to prevent cascading failures across multiple decks. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Diagnostics Scheduling",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Diagnostics Scheduling.",
      "answers": [
        {
          "text": "Schedule during low-traffic hours.",
          "score": 9,
          "type": "best",
          "details": "Limits escalation of variance that can spiral into containment breach."
        },
        {
          "text": "Balance partial diagnostics across systems.",
          "score": 7,
          "type": "alternate",
          "details": "Draws directly on Academy lessons about redundancy and systemic caution. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Run diagnostics immediately regardless.",
          "score": 6,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "System Load Balancing",
      "summary": "Maintaining warp plasma balance requires precision in EPS flow regulation and field coil harmonics, preventing stress cascades across the system.",
      "answers": [
        {
          "text": "Shift workloads to auxiliary processors.",
          "score": 9,
          "type": "best",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities. (variation 2)"
        },
        {
          "text": "Prioritize bridge functions.",
          "score": 8,
          "type": "alternate",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Delegate to autopilot completely.",
          "score": 6,
          "type": "alternate",
          "details": "Contains faults before they can propagate into other subsystems. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Log Management",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Log Management.",
      "answers": [
        {
          "text": "Sort logs and archive by system.",
          "score": 9,
          "type": "best",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. (variation 3)"
        },
        {
          "text": "Export logs to portable storage.",
          "score": 7,
          "type": "alternate",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Fabricate log entries for efficiency.",
          "score": 3,
          "type": "alternate",
          "details": "Guards against equipment loss by containing hazards within forcefields. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Software Update Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Software Update Drill.",
      "answers": [
        {
          "text": "Update in phases with testing.",
          "score": 9,
          "type": "best",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions. (variation 2)"
        },
        {
          "text": "Install all updates immediately.",
          "score": 6,
          "type": "alternate",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Delay updates until end of mission.",
          "score": 4,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "System Prioritization",
      "summary": "Computer system scenarios emphasize isolation of malfunctioning subroutines, protection of LCARS control, and restoration of ship automation.",
      "answers": [
        {
          "text": "Favor navigation and tactical.",
          "score": 9,
          "type": "best",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. (variation 4)"
        },
        {
          "text": "Favor science labs and sensors.",
          "score": 8,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Equal distribution across systems.",
          "score": 7,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Pattern Test",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Pattern Test.",
      "answers": [
        {
          "text": "Check molecular integrity for each tool.",
          "score": 9,
          "type": "best",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. (variation 2)"
        },
        {
          "text": "Run only one replication test.",
          "score": 4,
          "type": "alternate",
          "details": "Prepares structural fields for sustained loads, preventing fatigue microfractures. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Delegate testing to another cadet.",
          "score": 3,
          "type": "alternate",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Nutritional Verification",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Nutritional Verification.",
      "answers": [
        {
          "text": "Run scans for molecular balance.",
          "score": 9,
          "type": "best",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. (variation 2)"
        },
        {
          "text": "Ask medical staff to confirm.",
          "score": 7,
          "type": "alternate",
          "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Taste-test only.",
          "score": 4,
          "type": "alternate",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Supply Programming",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Supply Programming.",
      "answers": [
        {
          "text": "Load supply patterns and verify checksums.",
          "score": 9,
          "type": "best",
          "details": "Ensures oxygen levels remain safe while power allocation is under review."
        },
        {
          "text": "Request instructor to load patterns.",
          "score": 6,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Skip checksum verification.",
          "score": 3,
          "type": "alternate",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Emergency Reprogramming",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Emergency Reprogramming.",
      "answers": [
        {
          "text": "Load verified medical pattern libraries.",
          "score": 9,
          "type": "best",
          "details": "Limits escalation of variance that can spiral into containment breach. (variation 2)"
        },
        {
          "text": "Attempt to improvise formula manually.",
          "score": 5,
          "type": "alternate",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Delay programming.",
          "score": 3,
          "type": "alternate",
          "details": "Draws directly on Academy lessons about redundancy and systemic caution. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Diagnostics Cycle",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Diagnostics Cycle.",
      "answers": [
        {
          "text": "Run full diagnostic cycle.",
          "score": 9,
          "type": "best",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives."
        },
        {
          "text": "Run minimal tests only.",
          "score": 6,
          "type": "alternate",
          "details": "Limits escalation of variance that can spiral into containment breach. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Delegate to automation.",
          "score": 5,
          "type": "alternate",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Oxygen Mix Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Oxygen Mix Drill.",
      "answers": [
        {
          "text": "Continuously adjust scrubbers.",
          "score": 9,
          "type": "best",
          "details": "Guards against equipment loss by containing hazards within forcefields."
        },
        {
          "text": "Overcompensate airflow manually.",
          "score": 5,
          "type": "alternate",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Request medical to monitor crew only.",
          "score": 3,
          "type": "alternate",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Deck Balance Simulation",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Deck Balance Simulation.",
      "answers": [
        {
          "text": "Reroute airflow manually.",
          "score": 9,
          "type": "best",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. (variation 2)"
        },
        {
          "text": "Adjust by equalizing across ship.",
          "score": 8,
          "type": "alternate",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Wait for system to stabilize itself.",
          "score": 3,
          "type": "alternate",
          "details": "Keeps command informed through measurable, transparent system status. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Scrubber Efficiency Test",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Scrubber Efficiency Test.",
      "answers": [
        {
          "text": "Increase cycle frequency.",
          "score": 9,
          "type": "best",
          "details": "Keeps command informed through measurable, transparent system status."
        },
        {
          "text": "Delegate results to automation.",
          "score": 4,
          "type": "alternate",
          "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Run partial cycle.",
          "score": 3,
          "type": "alternate",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Simulation Monitoring",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Simulation Monitoring.",
      "answers": [
        {
          "text": "Track life signs closely.",
          "score": 9,
          "type": "best",
          "details": "Holds system integrity long enough for backup units to engage safely. (variation 3)"
        },
        {
          "text": "Let computer balance automatically.",
          "score": 6,
          "type": "alternate",
          "details": "Keeps command informed through measurable, transparent system status. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Record only anomalies.",
          "score": 5,
          "type": "alternate",
          "details": "Maintains shield cohesion without overtaxing emitter relays. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Instructor Check",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Check.",
      "answers": [
        {
          "text": "Adjust airflow immediately.",
          "score": 9,
          "type": "best",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. (variation 3)"
        },
        {
          "text": "Ask for instructions.",
          "score": 6,
          "type": "alternate",
          "details": "Contains faults before they can propagate into other subsystems. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Delay for analysis.",
          "score": 5,
          "type": "alternate",
          "details": "Reduces feedback risk from EPS taps under high-current operation. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    },
    {
      "scenario": "Cargo Bay Stability",
      "summary": "Maintaining warp plasma balance requires precision in EPS flow regulation and field coil harmonics, preventing stress cascades across the system.",
      "answers": [
        {
          "text": "Adjust thermal regulators gradually.",
          "score": 9,
          "type": "best",
          "details": "Holds system integrity long enough for backup units to engage safely. (variation 4)"
        },
        {
          "text": "Overcool entire bay.",
          "score": 6,
          "type": "alternate",
          "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Request cargo relocation.",
          "score": 5,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Crew Deck Adjustment",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Crew Deck Adjustment.",
      "answers": [
        {
          "text": "Balance thermal regulators by deck.",
          "score": 9,
          "type": "best",
          "details": "Reduces feedback risk from EPS taps under high-current operation. (variation 2)"
        },
        {
          "text": "Overheat decks to stress-test system.",
          "score": 4,
          "type": "alternate",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. Still, relying on this path may leave vulnerabilities that should not be ignored."
        },
        {
          "text": "Shut down climate system entirely.",
          "score": 3,
          "type": "alternate",
          "details": "Contains faults before they can propagate into other subsystems. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        }
      ]
    },
    {
      "scenario": "Lab Temperature Control",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Lab Temperature Control.",
      "answers": [
        {
          "text": "Maintain precise lab temperature via direct monitoring.",
          "score": 9,
          "type": "best",
          "details": "Provides redundancy that ensures recovery if the first response fails. (variation 3)"
        },
        {
          "text": "Overcool labs to guarantee equipment safety.",
          "score": 6,
          "type": "alternate",
          "details": "Prioritizes survivability of the vessel above performance efficiency. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Assign climate control to computer automation only.",
          "score": 5,
          "type": "alternate",
          "details": "Maintains shield cohesion without overtaxing emitter relays. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Engineering Bay Stability",
      "summary": "Maintaining warp plasma balance requires precision in EPS flow regulation and field coil harmonics, preventing stress cascades across the system.",
      "answers": [
        {
          "text": "Balance cooling with machinery operation levels.",
          "score": 9,
          "type": "best",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. (variation 2)"
        },
        {
          "text": "Request instructor intervention.",
          "score": 6,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Overcool engineering deck unnecessarily.",
          "score": 4,
          "type": "alternate",
          "details": "Draws directly on Academy lessons about redundancy and systemic caution. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Instructor Thermal Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Thermal Drill.",
      "answers": [
        {
          "text": "Adjust regulators shipwide to stabilize.",
          "score": 9,
          "type": "best",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. (variation 3)"
        },
        {
          "text": "Overpower cooling systems despite energy costs.",
          "score": 7,
          "type": "alternate",
          "details": "Guards against equipment loss by containing hazards within forcefields. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Delegate control to holodeck AI.",
          "score": 4,
          "type": "alternate",
          "details": "Maintains shield cohesion without overtaxing emitter relays. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Containment Drill",
      "summary": "Containment scenarios stress emergency procedures for antimatter regulation, rapid field reinforcement, and plasma venting to avert catastrophic failure.",
      "answers": [
        {
          "text": "Seal ducts and activate biofilters.",
          "score": 9,
          "type": "best",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. (variation 4)"
        },
        {
          "text": "Overpower scrubbers at max setting.",
          "score": 7,
          "type": "alternate",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Wait for medical staff to respond.",
          "score": 5,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        }
      ]
    },
    {
      "scenario": "Decontamination Exercise",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Decontamination Exercise.",
      "answers": [
        {
          "text": "Activate biofilter sweep and monitor progress.",
          "score": 9,
          "type": "best",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. (variation 3)"
        },
        {
          "text": "Overpower filters to finish faster.",
          "score": 6,
          "type": "alternate",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Delegate to another team.",
          "score": 4,
          "type": "alternate",
          "details": "Maintains shield cohesion without overtaxing emitter relays. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Simulation Containment",
      "summary": "Containment scenarios stress emergency procedures for antimatter regulation, rapid field reinforcement, and plasma venting to avert catastrophic failure.",
      "answers": [
        {
          "text": "Seal bulkheads and reroute air circulation.",
          "score": 9,
          "type": "best",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities. (variation 3)"
        },
        {
          "text": "Evacuate crew only without sealing.",
          "score": 5,
          "type": "alternate",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Move all crew to one deck instead.",
          "score": 4,
          "type": "alternate",
          "details": "Prepares structural fields for sustained loads, preventing fatigue microfractures. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Medical Coordination",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Medical Coordination.",
      "answers": [
        {
          "text": "Follow medical instructions for filter settings.",
          "score": 9,
          "type": "best",
          "details": "Prepares structural fields for sustained loads, preventing fatigue microfractures."
        },
        {
          "text": "Run maximum sterilization without approval.",
          "score": 6,
          "type": "alternate",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Apply random filter cycles.",
          "score": 3,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Instructor Biohazard Test",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Biohazard Test.",
      "answers": [
        {
          "text": "Seal ducts instantly and engage biofilters.",
          "score": 9,
          "type": "best",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. (variation 4)"
        },
        {
          "text": "Request instructor assistance.",
          "score": 5,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Wait for confirmation before acting.",
          "score": 4,
          "type": "alternate",
          "details": "Contains faults before they can propagate into other subsystems. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        }
      ]
    },
    {
      "scenario": "Buffer Management Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Buffer Management Drill.",
      "answers": [
        {
          "text": "Balance queues across auxiliary buffers.",
          "score": 9,
          "type": "best",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. (variation 2)"
        },
        {
          "text": "Delegate to automation only.",
          "score": 6,
          "type": "alternate",
          "details": "Limits escalation of variance that can spiral into containment breach. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Abort drill entirely.",
          "score": 3,
          "type": "alternate",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Evacuation Queue",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Evacuation Queue.",
      "answers": [
        {
          "text": "Stagger cycles to prevent overload.",
          "score": 9,
          "type": "best",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. (variation 5)"
        },
        {
          "text": "Reroute excess to cargo transporter.",
          "score": 8,
          "type": "alternate",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Run partial transports only.",
          "score": 3,
          "type": "alternate",
          "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Buffer Prioritization",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Buffer Prioritization.",
      "answers": [
        {
          "text": "Follow evacuation priority orders.",
          "score": 9,
          "type": "best",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. (variation 5)"
        },
        {
          "text": "Beam civilians first against orders.",
          "score": 6,
          "type": "alternate",
          "details": "Guards against equipment loss by containing hazards within forcefields. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Let automation decide priorities.",
          "score": 4,
          "type": "alternate",
          "details": "Draws directly on Academy lessons about redundancy and systemic caution. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Cycle Timing Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Cycle Timing Drill.",
      "answers": [
        {
          "text": "Shorten cycles slightly with monitoring.",
          "score": 9,
          "type": "best",
          "details": "Secures ship operations by following LCARS diagnostic discipline."
        },
        {
          "text": "Keep default timing only.",
          "score": 6,
          "type": "alternate",
          "details": "Reduces feedback risk from EPS taps under high-current operation. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        },
        {
          "text": "Shorten cycles drastically for speed.",
          "score": 5,
          "type": "alternate",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Instructor Buffer Test",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Buffer Test.",
      "answers": [
        {
          "text": "Balance loads across all buffers carefully.",
          "score": 9,
          "type": "best",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards. (variation 3)"
        },
        {
          "text": "Transfer to cargo transporter for backup.",
          "score": 8,
          "type": "alternate",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Allow automation to fail safely.",
          "score": 5,
          "type": "alternate",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Scan Setup Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Scan Setup Drill.",
      "answers": [
        {
          "text": "Set parameters for broad-spectrum scan.",
          "score": 9,
          "type": "best",
          "details": "Reduces feedback risk from EPS taps under high-current operation. (variation 3)"
        },
        {
          "text": "Apply narrow scan only.",
          "score": 6,
          "type": "alternate",
          "details": "Guards against equipment loss by containing hazards within forcefields. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Run outdated presets.",
          "score": 3,
          "type": "alternate",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Microbe Filter Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Microbe Filter Drill.",
      "answers": [
        {
          "text": "Test and calibrate filter bands.",
          "score": 9,
          "type": "best",
          "details": "Guards against equipment loss by containing hazards within forcefields. (variation 2)"
        },
        {
          "text": "Request sickbay to handle later.",
          "score": 5,
          "type": "alternate",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Overpower filter indiscriminately.",
          "score": 4,
          "type": "alternate",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 2)"
        }
      ]
    },
    {
      "scenario": "Quarantine Exercise",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Quarantine Exercise.",
      "answers": [
        {
          "text": "Isolate patterns safely in quarantine buffer.",
          "score": 9,
          "type": "best",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. (variation 2)"
        },
        {
          "text": "Wait for medical confirmation only.",
          "score": 7,
          "type": "alternate",
          "details": "Provides redundancy that ensures recovery if the first response fails. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Purge patterns without analysis.",
          "score": 3,
          "type": "alternate",
          "details": "Limits escalation of variance that can spiral into containment breach. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Precision Filter Training",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Precision Filter Training.",
      "answers": [
        {
          "text": "Carefully tune and monitor output.",
          "score": 9,
          "type": "best",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions. (variation 3)"
        },
        {
          "text": "Delegate filter to automation.",
          "score": 6,
          "type": "alternate",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Overpower filter and risk damage.",
          "score": 4,
          "type": "alternate",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Instructor Biofilter Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Biofilter Drill.",
      "answers": [
        {
          "text": "Isolate patterns immediately.",
          "score": 9,
          "type": "best",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. (variation 6)"
        },
        {
          "text": "Overpower filter field.",
          "score": 6,
          "type": "alternate",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        },
        {
          "text": "Shut down transporter completely.",
          "score": 3,
          "type": "alternate",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Emergency Evacuation Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Emergency Evacuation Drill.",
      "answers": [
        {
          "text": "Prioritize medical and civilians.",
          "score": 9,
          "type": "best",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. (variation 6)"
        },
        {
          "text": "Beam cargo first.",
          "score": 4,
          "type": "alternate",
          "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Abort drill entirely.",
          "score": 3,
          "type": "alternate",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Bridge Evacuation",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Bridge Evacuation.",
      "answers": [
        {
          "text": "Transport all officers simultaneously.",
          "score": 9,
          "type": "best",
          "details": "Contains faults before they can propagate into other subsystems. (variation 2)"
        },
        {
          "text": "Beam one at a time.",
          "score": 6,
          "type": "alternate",
          "details": "Limits escalation of variance that can spiral into containment breach. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Request automation to finish.",
          "score": 5,
          "type": "alternate",
          "details": "Limits escalation of variance that can spiral into containment breach. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        }
      ]
    },
    {
      "scenario": "Medical Priority Transport",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Medical Priority Transport.",
      "answers": [
        {
          "text": "Prioritize medical cases.",
          "score": 9,
          "type": "best",
          "details": "Draws directly on Academy lessons about redundancy and systemic caution."
        },
        {
          "text": "Overpower buffers for speed.",
          "score": 6,
          "type": "alternate",
          "details": "Draws directly on Academy lessons about redundancy and systemic caution. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Abort medical beam-out.",
          "score": 3,
          "type": "alternate",
          "details": "Keeps command informed through measurable, transparent system status. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "Critical System Evacuation",
      "summary": "Computer system scenarios emphasize isolation of malfunctioning subroutines, protection of LCARS control, and restoration of ship automation.",
      "answers": [
        {
          "text": "Beam engineers first to safety.",
          "score": 9,
          "type": "best",
          "details": "Guards against equipment loss by containing hazards within forcefields. (variation 3)"
        },
        {
          "text": "Overpower transporter output.",
          "score": 5,
          "type": "alternate",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Delegate to computer.",
          "score": 4,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 8)"
        }
      ]
    },
    {
      "scenario": "Instructor Emergency Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Emergency Drill.",
      "answers": [
        {
          "text": "Follow evacuation plan precisely.",
          "score": 9,
          "type": "best",
          "details": "Limits escalation of variance that can spiral into containment breach. (variation 3)"
        },
        {
          "text": "Request instructor help.",
          "score": 4,
          "type": "alternate",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Overload transporters recklessly.",
          "score": 3,
          "type": "alternate",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        }
      ]
    },
    {
      "scenario": "Holodeck Safety Setup",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Holodeck Safety Setup.",
      "answers": [
        {
          "text": "Enable all safeties per manual.",
          "score": 9,
          "type": "best",
          "details": "Minimizes transporter drift by enforcing pattern integrity standards. (variation 4)"
        },
        {
          "text": "Delegate to computer defaults.",
          "score": 6,
          "type": "alternate",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Skip safety entirely.",
          "score": 3,
          "type": "alternate",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        }
      ]
    },
    {
      "scenario": "Force Threshold Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Force Threshold Drill.",
      "answers": [
        {
          "text": "Set safe but challenging threshold.",
          "score": 9,
          "type": "best",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. (variation 2)"
        },
        {
          "text": "Delegate to automation.",
          "score": 4,
          "type": "alternate",
          "details": "Keeps command informed through measurable, transparent system status. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Cancel drill.",
          "score": 3,
          "type": "alternate",
          "details": "Reduces feedback risk from EPS taps under high-current operation. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 3)"
        }
      ]
    },
    {
      "scenario": "AI Restraint Setup",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: AI Restraint Setup.",
      "answers": [
        {
          "text": "Enable ethical restraints fully.",
          "score": 9,
          "type": "best",
          "details": "Provides redundancy that ensures recovery if the first response fails. (variation 4)"
        },
        {
          "text": "Delegate setup to computer.",
          "score": 5,
          "type": "alternate",
          "details": "Guards against equipment loss by containing hazards within forcefields. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        },
        {
          "text": "Abort setup.",
          "score": 3,
          "type": "alternate",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        }
      ]
    },
    {
      "scenario": "Emergency Stop Drill",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Emergency Stop Drill.",
      "answers": [
        {
          "text": "Trigger stop instantly when alarm sounds.",
          "score": 9,
          "type": "best",
          "details": "Secures ship operations by following LCARS diagnostic discipline. (variation 2)"
        },
        {
          "text": "Delegate to instructor.",
          "score": 5,
          "type": "alternate",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Delay stop intentionally.",
          "score": 3,
          "type": "alternate",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        }
      ]
    },
    {
      "scenario": "Instructor Safety Test",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Safety Test.",
      "answers": [
        {
          "text": "Re-enable safeties immediately.",
          "score": 9,
          "type": "best",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. (variation 3)"
        },
        {
          "text": "Shut down holodeck entirely.",
          "score": 7,
          "type": "alternate",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        },
        {
          "text": "Delegate to automation.",
          "score": 3,
          "type": "alternate",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Coverage Setup",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Coverage Setup.",
      "answers": [
        {
          "text": "Position emitters correctly.",
          "score": 9,
          "type": "best",
          "details": "Preserves replicator reliability by ensuring clean pattern matrices. (variation 4)"
        },
        {
          "text": "Delegate to automation.",
          "score": 6,
          "type": "alternate",
          "details": "Balances EPS load to prevent cascading failures across multiple decks. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Abort setup.",
          "score": 3,
          "type": "alternate",
          "details": "Secures ship operations by following LCARS diagnostic discipline. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 9)"
        }
      ]
    },
    {
      "scenario": "Emitter Calibration",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Emitter Calibration.",
      "answers": [
        {
          "text": "Calibrate per manual.",
          "score": 9,
          "type": "best",
          "details": "Keeps life support stable under stress, aligning with Federation survival priorities. (variation 4)"
        },
        {
          "text": "Delegate to computer.",
          "score": 6,
          "type": "alternate",
          "details": "Balances EPS load to prevent cascading failures across multiple decks. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Abort calibration.",
          "score": 3,
          "type": "alternate",
          "details": "Prepares structural fields for sustained loads, preventing fatigue microfractures. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Emitter Relay Test",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Emitter Relay Test.",
      "answers": [
        {
          "text": "Run full check cycle.",
          "score": 9,
          "type": "best",
          "details": "Guards against equipment loss by containing hazards within forcefields. (variation 4)"
        },
        {
          "text": "Delegate to automation.",
          "score": 6,
          "type": "alternate",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Run partial checks.",
          "score": 4,
          "type": "alternate",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        }
      ]
    },
    {
      "scenario": "Coverage Simulation",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Coverage Simulation.",
      "answers": [
        {
          "text": "Monitor and adjust actively.",
          "score": 9,
          "type": "best",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. (variation 4)"
        },
        {
          "text": "Delegate to automation only.",
          "score": 6,
          "type": "alternate",
          "details": "Prepares structural fields for sustained loads, preventing fatigue microfractures. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        },
        {
          "text": "Overpower emitters regardless.",
          "score": 4,
          "type": "alternate",
          "details": "Maintains shield cohesion without overtaxing emitter relays. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        }
      ]
    },
    {
      "scenario": "Instructor Emitter Test",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Instructor Emitter Test.",
      "answers": [
        {
          "text": "Compensate using others.",
          "score": 9,
          "type": "best",
          "details": "Protects morale as well as safety by avoiding unnecessary risk exposure. (variation 3)"
        },
        {
          "text": "Delegate fix to automation.",
          "score": 6,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        },
        {
          "text": "Abort sim.",
          "score": 4,
          "type": "alternate",
          "details": "Reduces feedback risk from EPS taps under high-current operation. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 4)"
        }
      ]
    },
    {
      "scenario": "Shutdown Drill",
      "summary": "Warp core shutdown drills emphasize staged antimatter cutoff, thermal bleed-off, and safing of magnetic containment to prevent destabilization.",
      "answers": [
        {
          "text": "Follow manual procedure.",
          "score": 9,
          "type": "best",
          "details": "Maintains shield cohesion without overtaxing emitter relays. (variation 2)"
        },
        {
          "text": "Delegate to automation.",
          "score": 6,
          "type": "alternate",
          "details": "Demonstrates ethical engineering by minimizing crew hazard even during crises. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        },
        {
          "text": "Ignore shutdown request.",
          "score": 3,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 8)"
        }
      ]
    },
    {
      "scenario": "Timed Shutdown",
      "summary": "Warp core shutdown drills emphasize staged antimatter cutoff, thermal bleed-off, and safing of magnetic containment to prevent destabilization.",
      "answers": [
        {
          "text": "Execute quickly but correctly.",
          "score": 9,
          "type": "best",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. (variation 3)"
        },
        {
          "text": "Delegate to automation.",
          "score": 6,
          "type": "alternate",
          "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        },
        {
          "text": "Skip checks for speed.",
          "score": 3,
          "type": "alternate",
          "details": "Ensures oxygen levels remain safe while power allocation is under review. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Emergency Simulation Abort",
      "summary": "Engineering cadets must resolve a technical challenge consistent with Starfleet safety and Federation engineering protocols: Emergency Simulation Abort.",
      "answers": [
        {
          "text": "Trigger emergency abort immediately.",
          "score": 9,
          "type": "best",
          "details": "Holds system integrity long enough for backup units to engage safely. (variation 5)"
        },
        {
          "text": "Delegate to instructor.",
          "score": 5,
          "type": "alternate",
          "details": "Avoids shortcuts that have historically led to catastrophic failures in service records. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 9)"
        },
        {
          "text": "Delay abort.",
          "score": 3,
          "type": "alternate",
          "details": "Reduces the chance of plasma instability while preserving mission tempo. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        }
      ]
    },
    {
      "scenario": "System Reset Drill",
      "summary": "Computer system scenarios emphasize isolation of malfunctioning subroutines, protection of LCARS control, and restoration of ship automation.",
      "answers": [
        {
          "text": "Reset step by step.",
          "score": 9,
          "type": "best",
          "details": "Secures ship operations by following LCARS diagnostic discipline. (variation 3)"
        },
        {
          "text": "Delegate to automation.",
          "score": 6,
          "type": "alternate",
          "details": "Sustains mission effectiveness without sacrificing Federation principles. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 6)"
        },
        {
          "text": "Perform partial reset.",
          "score": 4,
          "type": "alternate",
          "details": "Shows foresight by preparing for escalating stress beyond immediate conditions. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 5)"
        }
      ]
    },
    {
      "scenario": "Instructor Shutdown Test",
      "summary": "Warp core shutdown drills emphasize staged antimatter cutoff, thermal bleed-off, and safing of magnetic containment to prevent destabilization.",
      "answers": [
        {
          "text": "Shut down immediately.",
          "score": 9,
          "type": "best",
          "details": "Maintains Starfleet standards of caution where improvisation might endanger lives. (variation 3)"
        },
        {
          "text": "Delegate to automation.",
          "score": 5,
          "type": "alternate",
          "details": "Protects the crew by respecting intermix protocols and maintaining containment margins. Still, relying on this path may leave vulnerabilities that should not be ignored. (variation 7)"
        },
        {
          "text": "Delay until safe.",
          "score": 4,
          "type": "alternate",
      "details": "Holds system integrity long enough for backup units to engage safely. Still, relying on this path may leave vulnerabilities that should not be ignored."
        }
      ]
    }
  ]
}