{
  "department": "Engineering",
  "study": [
    {
      "scenario": "Warp Core Initiation Drill",
      "summary": "During a controlled startup sequence at Starfleet Academy’s Engineering Complex, a cadet team must bring an NX-class training core to full plasma flow. A mis-timed antimatter injection could cause a containment quench and automatic lockdown.",
      "answers": [
        {
          "text": "Run the complete intermix calibration and verify magnetic constrictor fields before engaging antimatter flow.",
          "score": 9,
          "type": "best",
          "details": "Follows Federation Engineering Safety Protocol 101-A—safety first, procedure second. Ensures containment integrity and demonstrates command of warp-core fundamentals."
        },
        {
          "text": "Perform a low-level plasma ignition test before the full startup.",
          "score": 8,
          "type": "alternate",
          "details": "Shows initiative but wastes fuel and stresses the reaction chamber. Acceptable in simulation, less so in live drills."
        },
        {
          "text": "Engage matter and antimatter injectors simultaneously to save time.",
          "score": 3,
          "type": "alternate",
          "details": "Disregards all interlock safeguards; catastrophic failure almost certain. Demonstrates poor understanding of Starfleet safety culture."
        }
      ]
    },
    {
      "scenario": "EPS Conduit Overload",
      "summary": "While conducting a warp-power flow test, an EPS conduit surges after a faulty regulator sticks open. Power spikes are threatening to arc into the primary junction bay.",
      "answers": [
        {
          "text": "Cut plasma feed to the affected conduit and vent the excess through the auxiliary transfer grid.",
          "score": 9,
          "type": "best",
          "details": "Isolates the fault, preserves grid integrity, and protects personnel—core Starfleet engineering values of safety through containment."
        },
        {
          "text": "Route power to environmental systems to bleed off the overload.",
          "score": 7,
          "type": "alternate",
          "details": "Provides a quick dump path but risks system contamination. A fair stopgap under supervision."
        },
        {
          "text": "Boost magnetic constriction to hold plasma in place until pressure normalizes.",
          "score": 6,
          "type": "alternate",
          "details": "Temporarily stabilizes the conduit but invites cascading stress fractures. Technically clever, strategically unwise."
        }
      ]
    },
    {
      "scenario": "Transporter Pattern Buffer Degradation",
      "summary": "A test transport shows micro-fragmentation in the pattern buffer after repeated use of an experimental power tap.",
      "answers": [
        {
          "text": "Purge the buffer and recalibrate the phase compensators before further transports.",
          "score": 9,
          "type": "best",
          "details": "Protects crew safety and aligns with Starfleet’s zero-loss transport mandate established after the 22nd-century trials."
        },
        {
          "text": "Run a diagnostics cycle while keeping the buffer online for monitoring.",
          "score": 8,
          "type": "alternate",
          "details": "Acceptable for non-living test matter but risky for personnel; reflects solid analytical instincts."
        },
        {
          "text": "Ignore the minor phase drift and continue transporter operations.",
          "score": 5,
          "type": "alternate",
          "details": "Expedient but reckless—violates Transporter Operations Directive 14. Shows disregard for long-term reliability."
        }
      ]
    },
    {
      "scenario": "Structural Integrity Field Fluctuation",
      "summary": "During simulated combat maneuvers, the SIF begins fluctuating under stress, endangering hull stability in a turn at warp 6.",
      "answers": [
        {
          "text": "Re-route EPS flow to reinforce SIF generators and reduce inertial-dampener load.",
          "score": 9,
          "type": "best",
          "details": "Balances power priorities efficiently—Starfleet standard response emphasizing life and vessel preservation."
        },
        {
          "text": "Cut inertial dampeners entirely to free more power for the SIF.",
          "score": 7,
          "type": "alternate",
          "details": "Stabilizes the hull but risks crew injury. Effective only in unmanned simulation."
        },
        {
          "text": "Maintain present course and hope auto-balancing routines correct the field.",
          "score": 4,
          "type": "alternate",
          "details": "Delegates control to automation without situational oversight—contrary to Academy crisis-response training."
        }
      ]
    },
    {
      "scenario": "Environmental Systems Failure",
      "summary": "A malfunctioning atmospheric processor begins dumping carbon dioxide into the cadet simulator compartment.",
      "answers": [
        {
          "text": "Engage emergency life-support override, isolate the deck, and run scrubber back-flush protocol.",
          "score": 9,
          "type": "best",
          "details": "Swiftly restores breathable air and demonstrates Starfleet’s humanitarian engineering principles."
        },
        {
          "text": "Vent the compartment to space to remove the contamination.",
          "score": 7,
          "type": "alternate",
          "details": "Effective but hazardous; acceptable only if the area is confirmed unoccupied."
        },
        {
          "text": "Shut down the processor and await instructor orders.",
          "score": 5,
          "type": "alternate",
          "details": "Safe yet passive. Misses the chance to apply problem-solving under pressure."
        }
      ]
    },
    {
      "scenario": "Warp-Field Geometry Misalignment",
      "summary": "A training vessel experiences an asymmetric warp-field collapse during a speed-change drill.",
      "answers": [
        {
          "text": "Re-modulate the field coils to restore phase symmetry before re-engaging warp.",
          "score": 9,
          "type": "best",
          "details": "Standard corrective technique; upholds the principle of methodical calibration over brute force."
        },
        {
          "text": "Drop to impulse and reboot the warp system from standby.",
          "score": 8,
          "type": "alternate",
          "details": "Safe and practical, though slower than an in-flight correction."
        },
        {
          "text": "Ignore the warning and maintain warp until alignment stabilizes.",
          "score": 4,
          "type": "alternate",
          "details": "Violates operational safety regs—risk of core breach; demonstrates poor judgment."
        }
      ]
    },
    {
      "scenario": "Deflector Control Malfunction",
      "summary": "Micrometeoroid impacts increase after the navigational deflector begins phase-shifting off its target frequency.",
      "answers": [
        {
          "text": "Run a harmonic scan, re-tune the deflector emitters, and cycle through backup coils.",
          "score": 9,
          "type": "best",
          "details": "Balances efficiency and safety; textbook Starfleet maintenance response."
        },
        {
          "text": "Increase deflector power output by 200 percent to compensate.",
          "score": 6,
          "type": "alternate",
          "details": "Short-term fix that risks burnout. Shows enthusiasm but poor resource discipline."
        },
        {
          "text": "Disable the deflector to prevent further drain on EPS power.",
          "score": 3,
          "type": "alternate",
          "details": "Jeopardizes the vessel; contradicts Engineering Ethics Clause 3 on preventive safety."
        }
      ]
    },
    {
      "scenario": "Antimatter Containment Alarm",
      "summary": "During diagnostics, containment field strength on an antimatter pod dips two percent below nominal.",
      "answers": [
        {
          "text": "Engage emergency field reinforcement and initiate a controlled vent to auxiliary containment.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates composure and adherence to antimatter-handling regulations; prioritizes safety of ship and crew."
        },
        {
          "text": "Shut down the magnetic bottle entirely to restart the field coils.",
          "score": 7,
          "type": "alternate",
          "details": "Might work but risks uncontrolled annihilation during restart—technically risky."
        },
        {
          "text": "Ignore minor fluctuations as instrumentation error.",
          "score": 4,
          "type": "alternate",
          "details": "Dismissive approach inconsistent with Starfleet engineering accountability."
        }
      ]
    },
    {
      "scenario": "Holodeck Power Feedback",
      "summary": "A feedback surge from the holodeck’s energy grid begins drawing from the ship’s shield reserves.",
      "answers": [
        {
          "text": "Isolate the holodeck’s power couplings and shunt the feedback to auxiliary capacitors.",
          "score": 9,
          "type": "best",
          "details": "Protects both system integrity and crew safety—reflects Starfleet’s principle of containment over convenience."
        },
        {
          "text": "Shut down the holodeck main emitter array immediately.",
          "score": 8,
          "type": "alternate",
          "details": "Stops the drain quickly but risks data corruption. A solid emergency move if time is critical."
        },
        {
          "text": "Divert more power to shields to counter the drain.",
          "score": 5,
          "type": "alternate",
          "details": "Treats the symptom rather than the cause—poor systems analysis."
        }
      ]
    },
    {
      "scenario": "Replicator Contamination",
      "summary": "Routine quality control finds trace deuterium imbalance in replicated rations.",
      "answers": [
        {
          "text": "Purge the matter-stream filters and recalibrate molecular stabilizers.",
          "score": 9,
          "type": "best",
          "details": "Ensures crew health and demonstrates ethical responsibility consistent with Federation sanitation protocols."
        },
        {
          "text": "Switch to emergency ration stores until repairs are scheduled.",
          "score": 7,
          "type": "alternate",
          "details": "Prudent temporary solution but leaves underlying fault unresolved."
        },
        {
          "text": "Continue use; imbalance is within safe limits.",
          "score": 5,
          "type": "alternate",
          "details": "Technically permissible but careless—shows weak preventive discipline."
        }
      ]
    },
    {
      "scenario": "Transporter Power Loss",
      "summary": "A planetary evacuation is underway when a power fluctuation knocks out one of the transporter emitters.",
      "answers": [
        {
          "text": "Reroute power from secondary systems to restore the emitter and confirm pattern integrity before resuming transport.",
          "score": 9,
          "type": "best",
          "details": "Prioritizes lives while maintaining transporter safety margins—the Federation standard."
        },
        {
          "text": "Bypass the failed emitter and continue transport with partial array capacity.",
          "score": 7,
          "type": "alternate",
          "details": "Risk-tolerant approach; may succeed but violates redundancy doctrine."
        },
        {
          "text": "Attempt manual energize sequence without full diagnostics.",
          "score": 5,
          "type": "alternate",
          "details": "Reckless under duress; not acceptable per Starfleet emergency transport regulations."
        }
      ]
    },
    {
      "scenario": "Impulse Manifold Leak",
      "summary": "During docking maneuvers, plasma levels in the impulse manifold begin rising beyond safety thresholds.",
      "answers": [
        {
          "text": "Isolate the leaking manifold and reroute power through auxiliary impulse regulators.",
          "score": 9,
          "type": "best",
          "details": "Prevents plasma fire and preserves thrust control—precisely the response taught in Starfleet Engineering 302."
        },
        {
          "text": "Increase coolant flow to absorb the excess heat.",
          "score": 8,
          "type": "alternate",
          "details": "Mitigates the symptom but leaves the breach unaddressed. A workable short-term measure."
        },
        {
          "text": "Ignore the alert until after docking sequence completes.",
          "score": 4,
          "type": "alternate",
          "details": "Endangers crew and station; a serious procedural violation."
        }
      ]
    },
    {
      "scenario": "Subspace Field Contamination",
      "summary": "An experimental warp coil test leaves residual subspace eddies affecting communications.",
      "answers": [
        {
          "text": "Stabilize the area with counter-frequency pulses to collapse the eddies.",
          "score": 9,
          "type": "best",
          "details": "Shows understanding of subspace harmonics and Starfleet’s environmental responsibility."
        },
        {
          "text": "Deploy warning buoys and allow the eddies to dissipate naturally.",
          "score": 8,
          "type": "alternate",
          "details": "A safe fallback but fails to gain valuable data from the anomaly."
        },
        {
          "text": "Attempt to counter the effect by boosting standard comm frequencies.",
          "score": 5,
          "type": "alternate",
          "details": "Ineffective and wastes power; lacks grasp of subspace mechanics."
        }
      ]
    },
    {
      "scenario": "Power Relay Cascade Failure",
      "summary": "A damaged relay junction begins a cascade across multiple decks, threatening a full power loss.",
      "answers": [
        {
          "text": "Initiate a sectional power isolation and reroute through undamaged relays.",
          "score": 9,
          "type": "best",
          "details": "Efficient and prevents catastrophic grid collapse—fundamental Starfleet engineering discipline."
        },
        {
          "text": "Cut main power entirely to stop the cascade immediately.",
          "score": 7,
          "type": "alternate",
          "details": "Halts the damage but cripples ship systems; acceptable in dire emergencies only."
        },
        {
          "text": "Attempt to compensate with automatic grid balancing software.",
          "score": 5,
          "type": "alternate",
          "details": "Automation may fail faster than response time; overreliance on software is unsafe."
        }
      ]
    },
    {
      "scenario": "Deuterium Flow Obstruction",
      "summary": "During preflight checks, the deuterium injector feed shows inconsistent pressure readings.",
      "answers": [
        {
          "text": "Purge the injector assembly and perform manual pressure equalization.",
          "score": 9,
          "type": "best",
          "details": "Corrects flow irregularity at the source; adheres to Starfleet procedural thoroughness."
        },
        {
          "text": "Compensate electronically with higher injector pulse rates.",
          "score": 7,
          "type": "alternate",
          "details": "Buys time but masks a hardware fault. Shows adaptability yet incomplete analysis."
        },
        {
          "text": "Proceed to launch; minor fluctuations are within margin.",
          "score": 4,
          "type": "alternate",
          "details": "Dismissive of safety margins; contradicts launch-readiness protocol."
        }
      ]
    },
    {
      "scenario": "Auxiliary Generator Instability",
      "summary": "While offline for maintenance, the ship’s auxiliary generator begins oscillating at irregular frequencies.",
      "answers": [
        {
          "text": "Disengage the generator, recalibrate the harmonic dampers, and run a controlled restart.",
          "score": 9,
          "type": "best",
          "details": "Applies proper shutdown and calibration techniques; shows mastery of energy-field dynamics."
        },
        {
          "text": "Increase load to stabilize the generator under higher output.",
          "score": 7,
          "type": "alternate",
          "details": "Sometimes effective but risky; higher stress could worsen imbalance."
        },
        {
          "text": "Ignore minor oscillations and proceed with main power checks.",
          "score": 5,
          "type": "alternate",
          "details": "Neglects engineering prudence and could escalate into field collapse."
        }
      ]
    },
    {
      "scenario": "Computer Core Coolant Leak",
      "summary": "A microfracture in the isolinear core coolant system threatens to raise CPU temperature beyond tolerance.",
      "answers": [
        {
          "text": "Isolate the damaged conduit, reroute cooling loops, and purge the leak area.",
          "score": 9,
          "type": "best",
          "details": "Maintains data integrity and prevents hardware damage—standard Starfleet response."
        },
        {
          "text": "Lower computer processing priority to reduce thermal load.",
          "score": 8,
          "type": "alternate",
          "details": "Effective in the short term but impairs ship control systems."
        },
        {
          "text": "Seal off the compartment and wait for engineering crew assistance.",
          "score": 6,
          "type": "alternate",
          "details": "Safe but passive—fails to apply problem-solving initiative expected of cadets."
        }
      ]
    },
    {
      "scenario": "Sensor Array Phase Drift",
      "summary": "A starship’s long-range sensor array begins displaying phase-shifted readings inconsistent with known stellar data.",
      "answers": [
        {
          "text": "Realign the array emitters and recalibrate the subspace harmonics.",
          "score": 9,
          "type": "best",
          "details": "Restores accuracy and demonstrates solid comprehension of subspace phase theory."
        },
        {
          "text": "Cross-check the readings with navigational beacons and compensate mathematically.",
          "score": 8,
          "type": "alternate",
          "details": "An acceptable workaround but does not address the underlying drift."
        },
        {
          "text": "Ignore the anomaly; stellar drift could explain the variance.",
          "score": 5,
          "type": "alternate",
          "details": "Dismisses a technical fault as natural variance—poor diagnostic reasoning."
        }
      ]
    },
    {
      "scenario": "Fusion Reactor Magnetic Containment Failure",
      "summary": "A small fusion reactor powering a remote outpost suffers a partial magnetic containment collapse.",
      "answers": [
        {
          "text": "Engage emergency containment fields and vent excess plasma through safety manifolds.",
          "score": 9,
          "type": "best",
          "details": "Applies safety-first engineering and preserves structural integrity—key Starfleet practice."
        },
        {
          "text": "Attempt manual restart of containment coils without venting plasma.",
          "score": 7,
          "type": "alternate",
          "details": "Courageous but unwise; heat buildup may destroy the reactor housing."
        },
        {
          "text": "Evacuate personnel and allow reactor to self-quench.",
          "score": 6,
          "type": "alternate",
          "details": "Protects lives but sacrifices equipment unnecessarily—last-resort measure."
        }
      ]
    },
    {
      "scenario": "Shuttlecraft Power Distribution Fault",
      "summary": "A training shuttle experiences a power-distribution fault midflight; helm and shields draw from the same circuit.",
      "answers": [
        {
          "text": "Reallocate EPS relays to isolate helm control and shield circuits.",
          "score": 9,
          "type": "best",
          "details": "Restores proper load balance—demonstrates clear systems prioritization under stress."
        },
        {
          "text": "Reduce all power consumption until docking is achieved.",
          "score": 8,
          "type": "alternate",
          "details": "A safe conservative move, though not a lasting fix."
        },
        {
          "text": "Increase reactor output to handle the dual load.",
          "score": 5,
          "type": "alternate",
          "details": "Overtaxes the reactor; ignores root cause and risks failure cascade."
        }
      ]
    }
    {
      "scenario": "Plasma Conduit Rupture in Jefferies Tube",
      "summary": "During a maintenance crawl, a plasma conduit begins to overheat, threatening to rupture within the confined Jefferies tube.",
      "answers": [
        {
          "text": "Seal the section with emergency bulkheads and vent plasma through auxiliary manifolds.",
          "score": 9,
          "type": "best",
          "details": "Protects crew safety and follows emergency procedures for confined plasma incidents."
        },
        {
          "text": "Apply localized magnetic clamps to contain the breach temporarily.",
          "score": 8,
          "type": "alternate",
          "details": "Can stabilize the conduit briefly but doesn’t resolve underlying overload."
        },
        {
          "text": "Attempt manual repairs while plasma flow continues.",
          "score": 4,
          "type": "alternate",
          "details": "Grave violation of safety procedure; likely results in injury or worse."
        }
      ]
    },
    {
      "scenario": "Decompression Alarm on Engineering Deck",
      "summary": "A hull microfracture opens during warp stress, triggering a decompression alarm near the warp plasma conduits.",
      "answers": [
        {
          "text": "Activate emergency force fields and reroute personnel to sealed corridors.",
          "score": 9,
          "type": "best",
          "details": "Standard and safest containment; preserves life and system stability."
        },
        {
          "text": "Seal the breach manually with hull patch materials.",
          "score": 7,
          "type": "alternate",
          "details": "Shows initiative but exposes engineer to decompression risk."
        },
        {
          "text": "Ignore the alarm to maintain warp field alignment.",
          "score": 3,
          "type": "alternate",
          "details": "Endangers lives and violates all emergency safety directives."
        }
      ]
    },
    {
      "scenario": "Dilithium Matrix Fracture",
      "summary": "A routine power inspection reveals microfractures forming in a dilithium crystal during sustained warp travel.",
      "answers": [
        {
          "text": "Bring the ship to impulse and rotate the crystal to distribute stress evenly.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates deep understanding of warp intermix dynamics; prevents catastrophic failure."
        },
        {
          "text": "Increase plasma coolant to reduce stress on the crystal.",
          "score": 8,
          "type": "alternate",
          "details": "Buys time but delays the inevitable replacement."
        },
        {
          "text": "Continue at warp until maintenance is scheduled.",
          "score": 4,
          "type": "alternate",
          "details": "Neglects known failure indicators—poor risk assessment."
        }
      ]
    },
    {
      "scenario": "Turbolift System Power Surge",
      "summary": "A power fluctuation disables several turbolifts, trapping personnel between decks.",
      "answers": [
        {
          "text": "Cut main power to the turbolift network and manually release trapped cars using localized gravity control.",
          "score": 9,
          "type": "best",
          "details": "Prioritizes crew safety and avoids secondary surges."
        },
        {
          "text": "Attempt to reboot the network while power fluctuations persist.",
          "score": 6,
          "type": "alternate",
          "details": "Risky; could worsen the surge and damage controls."
        },
        {
          "text": "Ignore the trapped lifts until systems stabilize on their own.",
          "score": 4,
          "type": "alternate",
          "details": "Neglects personnel safety—unacceptable in Starfleet operations."
        }
      ]
    },
    {
      "scenario": "EPS Relay Fire",
      "summary": "A faulty relay in the EPS grid catches fire, threatening to spread along the power trunk line.",
      "answers": [
        {
          "text": "Deactivate the affected grid segment and use emergency suppression foam.",
          "score": 9,
          "type": "best",
          "details": "Stops fire propagation and adheres to shipboard emergency protocols."
        },
        {
          "text": "Cut power to the entire EPS system to ensure extinguishment.",
          "score": 8,
          "type": "alternate",
          "details": "Effective but cripples essential systems; last resort approach."
        },
        {
          "text": "Attempt to smother the fire manually without isolating power.",
          "score": 3,
          "type": "alternate",
          "details": "Dangerous and contrary to electrical fire response training."
        }
      ]
    },
    {
      "scenario": "Inertial Dampener Misalignment",
      "summary": "The ship’s inertial dampeners desynchronize during acceleration, causing dangerous inertial spikes on Deck 5.",
      "answers": [
        {
          "text": "Throttle back acceleration and resynchronize dampeners via EPS diagnostic subroutine.",
          "score": 9,
          "type": "best",
          "details": "Minimizes structural and biological harm; textbook response."
        },
        {
          "text": "Boost dampener power to compensate for the lag.",
          "score": 7,
          "type": "alternate",
          "details": "Temporary fix but could overheat stabilizers."
        },
        {
          "text": "Ignore fluctuations and maintain speed to preserve schedule.",
          "score": 4,
          "type": "alternate",
          "details": "Disregards crew safety; wholly unacceptable conduct."
        }
      ]
    },
    {
      "scenario": "Shield Generator Feedback",
      "summary": "During a combat simulation, shield generators begin experiencing destructive feedback from overlapping harmonic frequencies.",
      "answers": [
        {
          "text": "Disengage the primary generator and re-phase each emitter coil sequentially.",
          "score": 9,
          "type": "best",
          "details": "Methodical reset that prevents generator burnout; follows engineering combat readiness doctrine."
        },
        {
          "text": "Increase power to the emitters to overpower the feedback.",
          "score": 6,
          "type": "alternate",
          "details": "Forceful but damaging; risks full generator loss."
        },
        {
          "text": "Deactivate shields and reroute power to weapons.",
          "score": 5,
          "type": "alternate",
          "details": "Tactically aggressive but violates safety containment priorities."
        }
      ]
    },
    {
      "scenario": "Photon Torpedo Loading Malfunction",
      "summary": "A torpedo loading sequence halts mid-cycle due to a magnetic constrictor fault.",
      "answers": [
        {
          "text": "Lock down the launcher, vent the loading chamber, and repair the constrictor before resuming operations.",
          "score": 9,
          "type": "best",
          "details": "Prevents misfire and demonstrates disciplined ordnance-handling procedure."
        },
        {
          "text": "Manually override the fault to resume loading sequence.",
          "score": 6,
          "type": "alternate",
          "details": "Could work, but unsafe—risks inadvertent arming sequence."
        },
        {
          "text": "Disengage safety interlocks to force-load the torpedo.",
          "score": 3,
          "type": "alternate",
          "details": "Flagrant breach of Starfleet weapons safety protocol."
        }
      ]
    },
    {
      "scenario": "Environmental Gravity Loss",
      "summary": "A gravity generator outage causes multiple decks to lose gravity during a systems calibration.",
      "answers": [
        {
          "text": "Stabilize the power couplings and bring online auxiliary gravity generators sequentially.",
          "score": 9,
          "type": "best",
          "details": "Restores environmental safety with minimal disruption; standard procedure."
        },
        {
          "text": "Increase power to primary gravity systems to force restoration.",
          "score": 6,
          "type": "alternate",
          "details": "Could hasten restart but risks overloading power relays."
        },
        {
          "text": "Wait until automatic reset cycles restore gravity.",
          "score": 5,
          "type": "alternate",
          "details": "Relies too heavily on automation; fails to apply initiative."
        }
      ]
    },
    {
      "scenario": "Warp Core Coolant Leak",
      "summary": "A minor breach develops in the warp core coolant system, releasing hazardous deuterium vapor into Engineering.",
      "answers": [
        {
          "text": "Seal the breach, vent contaminated air through emergency filtration, and deploy containment fields.",
          "score": 9,
          "type": "best",
          "details": "Mitigates hazard efficiently; follows Starfleet warp-core emergency safety codes."
        },
        {
          "text": "Evacuate Engineering and rely on automatic safety systems to contain the leak.",
          "score": 8,
          "type": "alternate",
          "details": "Protects personnel but cedes control to automation."
        },
        {
          "text": "Ignore the vapor leak and maintain warp field operations.",
          "score": 3,
          "type": "alternate",
          "details": "Completely disregards contamination protocols—severe breach of duty."
        }
      ]
    }
    {
      "scenario": "Emergency Battery Depletion",
      "summary": "A shipboard power outage forces the crew to rely on emergency batteries, which begin depleting faster than projected.",
      "answers": [
        {
          "text": "Shut down nonessential systems and reroute power to life support and structural integrity fields.",
          "score": 9,
          "type": "best",
          "details": "Exemplifies Starfleet’s priorities under duress: preserve life and vessel before comfort."
        },
        {
          "text": "Attempt to recharge batteries by siphoning from auxiliary warp plasma stores.",
          "score": 7,
          "type": "alternate",
          "details": "Ingenious but potentially dangerous if containment levels aren’t monitored."
        },
        {
          "text": "Ignore depletion and continue normal operations until batteries fail.",
          "score": 3,
          "type": "alternate",
          "details": "Shows complete disregard for engineering foresight and command discipline."
        }
      ]
    },
    {
      "scenario": "Transporter Pattern Buffer Overload",
      "summary": "An emergency mass transport overloads the pattern buffer, risking data corruption of stored lifeforms.",
      "answers": [
        {
          "text": "Split the pattern streams across multiple buffers and lower cycle intervals to stabilize integrity.",
          "score": 9,
          "type": "best",
          "details": "Uses distributed buffering to uphold Federation transport safety ethics."
        },
        {
          "text": "Attempt a rapid single-buffer re-materialization to clear space.",
          "score": 7,
          "type": "alternate",
          "details": "Fast but reckless; partial data loss risk unacceptably high."
        },
        {
          "text": "Purge existing stored patterns to make room for new ones.",
          "score": 4,
          "type": "alternate",
          "details": "Destroys living patterns—gross violation of Starfleet moral code."
        }
      ]
    },
    {
      "scenario": "Matter-Antimatter Injector Timing Error",
      "summary": "A minor delay in antimatter injector sequencing threatens to destabilize the warp core intermix.",
      "answers": [
        {
          "text": "Engage injector synchronization protocol and monitor intermix chamber harmonics.",
          "score": 9,
          "type": "best",
          "details": "Procedurally correct and demonstrates steady crisis control."
        },
        {
          "text": "Manually override injector controls to restore proper rhythm.",
          "score": 7,
          "type": "alternate",
          "details": "Shows initiative but risks human error during critical timing."
        },
        {
          "text": "Continue operation without adjustment—small offsets are negligible.",
          "score": 4,
          "type": "alternate",
          "details": "Neglects the volatility of matter-antimatter reactions; unsafe."
        }
      ]
    },
    {
      "scenario": "Subspace Relay Malfunction",
      "summary": "A subspace communications relay begins emitting an unstable carrier wave that interferes with nearby navigation systems.",
      "answers": [
        {
          "text": "Shut down the relay, recalibrate modulation frequency, and reboot the subspace amplifier.",
          "score": 9,
          "type": "best",
          "details": "Standard corrective measure consistent with Starfleet Communications Corps procedure."
        },
        {
          "text": "Reduce output power to half to minimize interference.",
          "score": 7,
          "type": "alternate",
          "details": "Minimizes disturbance but compromises communication range."
        },
        {
          "text": "Ignore interference reports; they’re likely due to local anomalies.",
          "score": 5,
          "type": "alternate",
          "details": "Dismisses diagnostic responsibility and endangers navigation traffic."
        }
      ]
    },
    {
      "scenario": "Plasma Injector Coolant Contamination",
      "summary": "Coolant contamination causes injector temperature spikes beyond design limits during warp flight.",
      "answers": [
        {
          "text": "Drop out of warp, purge coolant, and flush injectors with verified clean supply.",
          "score": 9,
          "type": "best",
          "details": "Applies the Prime Directive of safety first; prioritizes containment over haste."
        },
        {
          "text": "Increase coolant flow to counter the heat.",
          "score": 7,
          "type": "alternate",
          "details": "May prolong operation but risks system corrosion."
        },
        {
          "text": "Ignore spike warnings until redline levels appear.",
          "score": 4,
          "type": "alternate",
          "details": "Reckless delay endangers propulsion systems and lives."
        }
      ]
    },
    {
      "scenario": "EPS Conduit Contamination by Bio-Gel Packs",
      "summary": "A bio-gel pack leak introduces organic residue into an EPS junction, affecting power relay efficiency.",
      "answers": [
        {
          "text": "Shut down the affected EPS grid and sterilize the conduits before restoring power.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates proper handling of mixed bio-electronic contamination."
        },
        {
          "text": "Attempt to flush the conduits with high-energy plasma bursts.",
          "score": 7,
          "type": "alternate",
          "details": "Removes residue but risks burning out junctions."
        },
        {
          "text": "Ignore the contamination; the EPS grid can compensate.",
          "score": 5,
          "type": "alternate",
          "details": "Short-sighted and negligent toward long-term system health."
        }
      ]
    },
    {
      "scenario": "Impulse Engine Fuel Containment Crack",
      "summary": "Cracks in the impulse fusion fuel chamber are discovered following a high-stress orbital insertion.",
      "answers": [
        {
          "text": "Cease engine operations, seal cracks using magnetic welders, and replace chamber lining.",
          "score": 9,
          "type": "best",
          "details": "Adheres to Starfleet containment protocol and sound engineering judgment."
        },
        {
          "text": "Reduce thrust output to minimize stress until replacement parts arrive.",
          "score": 8,
          "type": "alternate",
          "details": "A conservative, short-term measure acceptable under limited supervision."
        },
        {
          "text": "Maintain operations as usual; cracks are minor.",
          "score": 5,
          "type": "alternate",
          "details": "Overconfidence that could lead to catastrophic containment failure."
        }
      ]
    },
    {
      "scenario": "Transporter Pattern Interference from Solar Radiation",
      "summary": "High solar radiation levels cause pattern instability during personnel beam-down.",
      "answers": [
        {
          "text": "Reinforce the annular confinement beam and adjust for solar flux before transport.",
          "score": 9,
          "type": "best",
          "details": "Reflects proper risk management and technical competence."
        },
        {
          "text": "Proceed with transport using additional power to strengthen pattern lock.",
          "score": 7,
          "type": "alternate",
          "details": "Might work but ignores environmental mitigation protocols."
        },
        {
          "text": "Delay transport operations until radiation subsides.",
          "score": 8,
          "type": "alternate",
          "details": "Safe but inefficient; prioritizes crew safety at the cost of mission time."
        }
      ]
    },
    {
      "scenario": "Main Deflector Phase Distortion",
      "summary": "Subspace lensing effects distort the main deflector field during a long-range tachyon sweep.",
      "answers": [
        {
          "text": "Modulate deflector harmonics to compensate for subspace interference.",
          "score": 9,
          "type": "best",
          "details": "Shows applied understanding of field mechanics and Starfleet precision calibration."
        },
        {
          "text": "Increase power to the deflector array to punch through the interference.",
          "score": 6,
          "type": "alternate",
          "details": "May succeed but damages emitter arrays over time."
        },
        {
          "text": "Suspend the sweep and retry after subspace settles.",
          "score": 8,
          "type": "alternate",
          "details": "Cautious and safe but forfeits valuable data."
        }
      ]
    },
    {
      "scenario": "Computer Virus in Engineering Subsystem",
      "summary": "A foreign data signature infiltrates the ship’s engineering control subroutines.",
      "answers": [
        {
          "text": "Isolate the engineering core network and purge affected subroutines from backup.",
          "score": 9,
          "type": "best",
          "details": "Protects ship systems and aligns with Starfleet cybersecurity protocols."
        },
        {
          "text": "Run a level-2 diagnostic sweep while systems remain online.",
          "score": 7,
          "type": "alternate",
          "details": "Maintains functionality but allows virus propagation risk."
        },
        {
          "text": "Ignore the alert; likely a false positive.",
          "score": 4,
          "type": "alternate",
          "details": "Displays neglect of digital containment discipline."
        }
      ]
    }
    {
      "scenario": "Warp Field Phase Inversion",
      "summary": "An experimental warp field test inverts its phase alignment, threatening to tear the ship out of subspace unexpectedly.",
      "answers": [
        {
          "text": "Terminate warp field generation and gradually collapse the subspace bubble.",
          "score": 9,
          "type": "best",
          "details": "Safest and most precise method to restore normal-space integrity; aligns with Starfleet test procedures."
        },
        {
          "text": "Attempt to re-phase the field midflight.",
          "score": 7,
          "type": "alternate",
          "details": "Technically bold but hazardous under subspace instability."
        },
        {
          "text": "Maintain warp power until the inversion stabilizes naturally.",
          "score": 4,
          "type": "alternate",
          "details": "Passive and negligent; violates warp test containment guidelines."
        }
      ]
    },
    {
      "scenario": "Fusion Reactor Overpressure Warning",
      "summary": "A fusion reactor on Deck 12 registers a sharp pressure spike in the magnetic containment chamber.",
      "answers": [
        {
          "text": "Initiate immediate pressure venting through safety manifolds and recalibrate containment fields.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates proper adherence to reactor safety code and calm response to rising pressure conditions."
        },
        {
          "text": "Lower fuel injection rates to ease chamber pressure gradually.",
          "score": 8,
          "type": "alternate",
          "details": "Reduces strain but slower to prevent critical escalation."
        },
        {
          "text": "Ignore transient spikes; system stabilizers can manage them.",
          "score": 4,
          "type": "alternate",
          "details": "Assumes too much from automatic systems—contrary to Starfleet monitoring protocols."
        }
      ]
    },
    {
      "scenario": "Power Transfer Conduit Breach",
      "summary": "A breach develops in a primary power transfer conduit feeding the warp nacelles, causing dangerous plasma venting.",
      "answers": [
        {
          "text": "Isolate the conduit, vent plasma safely, and deploy field technicians in EV suits for external repair.",
          "score": 9,
          "type": "best",
          "details": "Prioritizes containment and safety while maintaining disciplined technical protocol."
        },
        {
          "text": "Route additional power to compensate for the lost conduit.",
          "score": 6,
          "type": "alternate",
          "details": "Maintains warp balance temporarily but worsens damage if left unchecked."
        },
        {
          "text": "Delay response until the ship drops out of warp.",
          "score": 5,
          "type": "alternate",
          "details": "Avoids risk in the short term but disregards escalating hazard."
        }
      ]
    },
    {
      "scenario": "Environmental Control System Overload",
      "summary": "Environmental systems overload after a coolant loop failure, raising temperatures throughout crew quarters.",
      "answers": [
        {
          "text": "Divert power from secondary life-support subsystems and reroute airflow through backup exchangers.",
          "score": 9,
          "type": "best",
          "details": "Maintains habitability efficiently—precise and ethical prioritization of crew well-being."
        },
        {
          "text": "Shut down life support temporarily to allow system cooldown.",
          "score": 6,
          "type": "alternate",
          "details": "Risky; may stabilize hardware but jeopardizes crew comfort and health."
        },
        {
          "text": "Ignore heat rise; tolerable levels don’t warrant intervention yet.",
          "score": 4,
          "type": "alternate",
          "details": "Dismissive and contrary to engineering monitoring protocols."
        }
      ]
    },
    {
      "scenario": "EPS Manifold Containment Seal Rupture",
      "summary": "During warp flight, a containment seal ruptures on the EPS manifold, releasing plasma and risking internal fires.",
      "answers": [
        {
          "text": "Drop from warp, seal off manifold access, and activate internal fire suppression systems.",
          "score": 9,
          "type": "best",
          "details": "Mitigates cascading failures decisively; follows warp plasma containment doctrine precisely."
        },
        {
          "text": "Vent EPS flow into secondary containment and continue at low warp.",
          "score": 7,
          "type": "alternate",
          "details": "Maintains propulsion but delays critical repair—acceptable under duress."
        },
        {
          "text": "Ignore alarms and maintain warp field stability.",
          "score": 3,
          "type": "alternate",
          "details": "Negligent; endangers ship and crew in violation of Regulation 401-A."
        }
      ]
    }
  ]
}
