{
  "department": "Medical",
  "exam": [
    {
      "scenario": "Unknown Pathogen Outbreak",
      "summary": "Several crew members develop rapid neurological symptoms after contact with a new planet’s atmosphere.",
      "answers": [
        {
          "text": "Quarantine all affected personnel and initiate full-spectrum viral and neurochemical analysis.",
          "score": 9,
          "type": "best",
          "details": "Adheres to Starfleet epidemiological standards and prioritizes containment."
        },
        {
          "text": "Treat the patients immediately with a general antiviral and hope for improvement.",
          "score": 8,
          "type": "alternate",
          "details": "Shows urgency but risks worsening an unidentified pathogen’s reaction."
        },
        {
          "text": "Ignore early symptoms until the medical database identifies a known correlation.",
          "score": 0,
          "type": "incorrect",
          "details": "Neglect invites spread and violates Starfleet medical response directives."
        }
      ]
    },
    {
      "scenario": "Ethical Transplant Decision",
      "summary": "A single rare organ could save either the captain or a civilian researcher.",
      "answers": [
        {
          "text": "Select the recipient based on triage ethics and probability of recovery, not rank.",
          "score": 9,
          "type": "best",
          "details": "Balances duty with medical impartiality, maintaining Federation ethical integrity."
        },
        {
          "text": "Give priority to the captain to ensure continued command stability.",
          "score": 8,
          "type": "alternate",
          "details": "Understandable but ethically questionable and contrary to medical neutrality."
        },
        {
          "text": "Refuse to act until Starfleet Command issues a directive.",
          "score": 0,
          "type": "incorrect",
          "details": "Abdicates medical authority and wastes precious time for the patient."
        }
      ]
    },
    {
      "scenario": "Experimental Treatment Request",
      "summary": "A patient’s condition is terminal, and the only potential cure is untested xenotherapy.",
      "answers": [
        {
          "text": "Seek informed consent and proceed under medical supervision within ethical bounds.",
          "score": 9,
          "type": "best",
          "details": "Balances compassion with professionalism and Starfleet medical law."
        },
        {
          "text": "Refuse the treatment since it lacks prior clinical verification.",
          "score": 8,
          "type": "alternate",
          "details": "Cautious but may deny the patient’s only viable chance."
        },
        {
          "text": "Administer the xenotherapy secretly without authorization.",
          "score": 0,
          "type": "incorrect",
          "details": "Violates patient rights and Starfleet bioethics; career-ending misconduct."
        }
      ]
    },
    {
      "scenario": "Radiation Casualties",
      "summary": "An away team returns with acute radiation exposure after a reactor breach.",
      "answers": [
        {
          "text": "Stabilize with metabolic inhibitors and initiate immediate cellular regeneration.",
          "score": 9,
          "type": "best",
          "details": "Follows Starfleet emergency medical protocol and minimizes tissue degradation."
        },
        {
          "text": "Place patients in stasis until full treatment plans are confirmed.",
          "score": 8,
          "type": "alternate",
          "details": "Protects patients but delays lifesaving intervention."
        },
        {
          "text": "Expose them to low-level radiation to desensitize cell receptors gradually.",
          "score": 0,
          "type": "incorrect",
          "details": "Unscientific and harmful; exacerbates radiation sickness."
        }
      ]
    },
    {
      "scenario": "Psychological Collapse",
      "summary": "A bridge officer begins exhibiting severe stress reactions after repeated combat duty.",
      "answers": [
        {
          "text": "Remove the officer from duty and prescribe counseling with the ship’s psychologist.",
          "score": 9,
          "type": "best",
          "details": "Shows sound judgment and awareness of long-term mental health impacts."
        },
        {
          "text": "Provide mild sedatives to maintain short-term operational readiness.",
          "score": 8,
          "type": "alternate",
          "details": "Temporarily stabilizing but does not address root causes."
        },
        {
          "text": "Ignore the behavior; stress is normal under combat conditions.",
          "score": 0,
          "type": "incorrect",
          "details": "Neglect of duty to safeguard crew welfare and mission integrity."
        }
      ]
    },
    {
      "scenario": "Medical Data Breach",
      "summary": "A hacker accesses confidential crew medical records.",
      "answers": [
        {
          "text": "Seal the database, audit access logs, and report the breach to command and security.",
          "score": 9,
          "type": "best",
          "details": "Upholds confidentiality and coordinates appropriate response."
        },
        {
          "text": "Quietly delete the accessed data and avoid drawing attention.",
          "score": 0,
          "type": "incorrect",
          "details": "Fails to address systemic vulnerability; violates data transparency policy."
        },
        {
          "text": "Notify the affected crew members while the investigation proceeds.",
          "score": 8,
          "type": "alternate",
          "details": "Ethical and proactive, but secondary to full containment."
        }
      ]
    },
    {
      "scenario": "Alien Anatomy Complication",
      "summary": "A patient’s species physiology differs drastically from Federation norms, and life signs are unreadable.",
      "answers": [
        {
          "text": "Collaborate with the patient’s planetary medical archives to establish accurate baselines.",
          "score": 9,
          "type": "best",
          "details": "Shows resourcefulness and cultural sensitivity essential in xenomedicine."
        },
        {
          "text": "Rely on universal bio-sign templates to interpret vital patterns.",
          "score": 8,
          "type": "alternate",
          "details": "Reasonable first attempt but potentially misleading across exotic anatomies."
        },
        {
          "text": "Proceed with human-standard treatments and monitor for improvement.",
          "score": 0,
          "type": "incorrect",
          "details": "Dangerous generalization likely to worsen condition or cause fatal error."
        }
      ]
    },
    {
      "scenario": "Medical Resource Shortage",
      "summary": "Supplies of a critical antiviral run dangerously low after multiple outbreaks.",
      "answers": [
        {
          "text": "Synthesize alternatives using ship’s replicators and ration remaining stock based on need.",
          "score": 9,
          "type": "best",
          "details": "Maximizes survival probability while upholding ethical triage."
        },
        {
          "text": "Distribute doses evenly among all symptomatic patients.",
          "score": 8,
          "type": "alternate",
          "details": "Fair on paper but strategically unsound; may waste limited effectiveness."
        },
        {
          "text": "Reserve all remaining doses for senior officers only.",
          "score": 0,
          "type": "incorrect",
          "details": "Gross violation of Federation medical ethics."
        }
      ]
    }
  ]
}
