{
  "department": "Science",
  "exam": [
    {
      "scenario": "Unidentified Spatial Rift",
      "summary": "A massive rift appears off the starboard bow, emitting chronometric radiation of unknown origin.",
      "answers": [
        {
          "text": "Initiate a full spectral analysis and deploy sensor buoys to collect long-range telemetry before closer study.",
          "score": 9,
          "type": "best",
          "details": "Displays scientific caution and prioritizes data integrity before exposure to unknown energy fields."
        },
        {
          "text": "Approach the rift to obtain direct sensor readings at short range.",
          "score": 8,
          "type": "alternate",
          "details": "Gathers superior data but risks structural compromise from radiation variance."
        },
        {
          "text": "Launch a probe directly into the anomaly without prior calibration.",
          "score": 0,
          "type": "incorrect",
          "details": "Neglects safety and renders any data unreliable due to sensor contamination."
        }
      ]
    },
    {
      "scenario": "Biological Contamination",
      "summary": "A research sample of unknown microbial life escapes containment aboard the ship.",
      "answers": [
        {
          "text": "Seal the lab, activate bio-containment protocols, and analyze samples remotely.",
          "score": 9,
          "type": "best",
          "details": "Follows Federation quarantine standards while maintaining scientific discipline."
        },
        {
          "text": "Neutralize the sample using a sterilization pulse to eliminate immediate threat.",
          "score": 8,
          "type": "alternate",
          "details": "Effective containment but destroys potential for study and classification."
        },
        {
          "text": "Retrieve the sample manually before it replicates further.",
          "score": 0,
          "type": "incorrect",
          "details": "Reckless exposure to an unknown pathogen endangers crew and mission."
        }
      ]
    },
    {
      "scenario": "Sensor Ghosts",
      "summary": "Multiple phantom sensor readings appear in deep space, moving erratically around the ship.",
      "answers": [
        {
          "text": "Cross-reference the readings with subspace harmonic interference and run a phased sensor recalibration.",
          "score": 9,
          "type": "best",
          "details": "Applies analytical precision to distinguish real phenomena from system artifacts."
        },
        {
          "text": "Dismiss the data as background radiation fluctuations and continue course.",
          "score": 0,
          "type": "incorrect",
          "details": "Premature assumption may overlook a significant spatial anomaly or cloaked vessel."
        },
        {
          "text": "Shut down primary sensors and rely solely on passive scans until anomalies disappear.",
          "score": 8,
          "type": "alternate",
          "details": "Reduces interference temporarily but sacrifices valuable situational awareness."
        }
      ]
    },
    {
      "scenario": "Unknown Element Discovery",
      "summary": "Analysis of asteroid fragments reveals a stable isotope not in Federation records.",
      "answers": [
        {
          "text": "Catalog the sample, isolate a small portion for safe study, and notify Starfleet Science Command.",
          "score": 9,
          "type": "best",
          "details": "Ensures verification and avoids unregulated experimentation."
        },
        {
          "text": "Synthesize additional material to accelerate the research process.",
          "score": 0,
          "type": "incorrect",
          "details": "Premature replication risks uncontrolled reaction with unknown properties."
        },
        {
          "text": "Conduct limited testing under containment using remote analysis drones.",
          "score": 8,
          "type": "alternate",
          "details": "Prudent but still carries minor hazard until full composition is verified."
        }
      ]
    },
    {
      "scenario": "Temporal Signature Detection",
      "summary": "A nearby nebula exhibits time-phase echoes matching the ship’s own energy profile.",
      "answers": [
        {
          "text": "Record data for later analysis and avoid direct interaction to prevent paradox risk.",
          "score": 9,
          "type": "best",
          "details": "Exemplifies temporal prudence consistent with Starfleet Science Division protocols."
        },
        {
          "text": "Adjust deflector harmonics to probe deeper into the echo field.",
          "score": 8,
          "type": "alternate",
          "details": "Could yield insight but risks feedback loops from temporal reflection."
        },
        {
          "text": "Attempt to phase the ship’s shields to synchronize with the temporal pattern.",
          "score": 0,
          "type": "incorrect",
          "details": "Dangerous experimentation may trigger causality instability."
        }
      ]
    },
    {
      "scenario": "Sensor Data Tampering",
      "summary": "Preliminary scans suggest manipulated readings within a planetary survey database.",
      "answers": [
        {
          "text": "Cross-verify archived data against raw sensor logs to isolate discrepancies.",
          "score": 9,
          "type": "best",
          "details": "Employs methodological verification and safeguards scientific credibility."
        },
        {
          "text": "Confront the research team with accusations of falsification.",
          "score": 0,
          "type": "incorrect",
          "details": "Assumptive behavior erodes collaboration and breaches ethics of inquiry."
        },
        {
          "text": "Re-scan the planet using an alternate array and compare data consistency.",
          "score": 8,
          "type": "alternate",
          "details": "Produces clarity but doubles workload and delays analysis."
        }
      ]
    },
    {
      "scenario": "Anomalous Gravity Field",
      "summary": "The ship experiences oscillating gravity despite all systems showing normal readings.",
      "answers": [
        {
          "text": "Deploy graviton sensors to chart field variations and correlate them with subspace disturbances.",
          "score": 9,
          "type": "best",
          "details": "Follows empirical observation to determine the underlying mechanism safely."
        },
        {
          "text": "Increase inertial dampening field strength until fluctuations cease.",
          "score": 8,
          "type": "alternate",
          "details": "Practical in the short term but masks the root cause of instability."
        },
        {
          "text": "Ignore the readings; the effect is probably sensor drift.",
          "score": 0,
          "type": "incorrect",
          "details": "Negligence risks unmonitored physical stress on structural integrity fields."
        }
      ]
    },
    {
      "scenario": "Xenobiological Signal",
      "summary": "An unknown transmission appears to match patterns of biochemical sequences.",
      "answers": [
        {
          "text": "Decrypt the signal using bioinformatics algorithms to determine if it represents sentient origin.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates analytical creativity and adherence to scientific ethics before action."
        },
        {
          "text": "Broadcast a universal greeting to prompt a direct response.",
          "score": 8,
          "type": "alternate",
          "details": "Open-minded but premature before confirming the signal’s intent or nature."
        },
        {
          "text": "Assume it’s interference and filter it out of the comm array.",
          "score": 0,
          "type": "incorrect",
          "details": "Dismissal forfeits potential discovery of first-contact importance."
        }
      ]
    }
  ]
}
