{
  "lab": [
    {
      "scenario": "Subspace Field Distortion",
      "summary": "Sensor readings show a local subspace distortion near the ship’s warp field boundary.",
      "answers": [
        {
          "text": "Recalibrate the subspace field sensors and conduct a low-level warp field modulation test.",
          "score": 9,
          "type": "best",
          "details": "Maintains safety margins while verifying sensor reliability and field stability."
        },
        {
          "text": "Run a gravimetric scan to determine if the distortion is naturally occurring or induced.",
          "score": 8,
          "type": "alternate",
          "details": "Identifies the nature of the anomaly, though not an immediate corrective action."
        },
        {
          "text": "Notify Engineering to temporarily increase warp core output for better data resolution.",
          "score": 7,
          "type": "alternate",
          "details": "Provides higher data fidelity but risks additional field disturbance."
        },
        {
          "text": "Ignore the readings; subspace anomalies are common and usually self-correcting.",
          "score": 3,
          "type": "incorrect",
          "details": "Neglects potential hazards; subspace fluctuations can destabilize warp geometry."
        },
        {
          "text": "Attempt to neutralize the distortion by generating a counter-frequency pulse without analysis.",
          "score": 0,
          "type": "incorrect",
          "details": "Acting without diagnostic confirmation risks amplifying the anomaly."
        }
      ]
    },
    {
      "scenario": "Unidentified Microbial Lifeform",
      "summary": "A newly discovered microbial organism exhibits rapid adaptation to containment protocols.",
      "answers": [
        {
          "text": "Quarantine the organism under level-4 containment and analyze its adaptive genome in isolation.",
          "score": 9,
          "type": "best",
          "details": "Ensures safety and enables scientific study within secure conditions."
        },
        {
          "text": "Adjust containment frequency fields incrementally while monitoring mutation rate.",
          "score": 8,
          "type": "alternate",
          "details": "Adaptive containment shows initiative but carries moderate exposure risk."
        },
        {
          "text": "Deploy a sterilization field to eliminate all traces immediately.",
          "score": 7,
          "type": "alternate",
          "details": "Prevents spread but forfeits valuable research potential."
        },
        {
          "text": "Lower containment levels to test the organism’s tolerance thresholds.",
          "score": 3,
          "type": "incorrect",
          "details": "Unethical and dangerous; violates Starfleet xenobiology protocol."
        },
        {
          "text": "Expose the organism to transporter pattern filters to ‘edit out’ unwanted traits.",
          "score": 0,
          "type": "incorrect",
          "details": "Transporter-based genetic manipulation without clearance breaches Federation medical law."
        }
      ]
    },
    {
      "scenario": "Sensor Data Corruption",
      "summary": "Astrometric data from long-range sensors returns contradictory readings on stellar mass composition.",
      "answers": [
        {
          "text": "Cross-reference with nearby probe telemetry and recalibrate the sensor array’s spectral filters.",
          "score": 9,
          "type": "best",
          "details": "Standard Starfleet correction ensuring data integrity and alignment with probe standards."
        },
        {
          "text": "Conduct a diagnostic on the sensor grid using controlled subspace interference patterns.",
          "score": 8,
          "type": "alternate",
          "details": "Effective for isolating distortion sources in the long-range sensor network."
        },
        {
          "text": "Recompile previous scans using predictive data smoothing algorithms.",
          "score": 7,
          "type": "alternate",
          "details": "Reasonable for trend analysis, though it risks masking real anomalies."
        },
        {
          "text": "Dismiss the discrepancy as software drift and proceed with current readings.",
          "score": 3,
          "type": "incorrect",
          "details": "Fails to verify data reliability; Starfleet science demands empirical accuracy."
        },
        {
          "text": "Attempt to compensate by amplifying the array’s subspace gain beyond calibration limits.",
          "score": 0,
          "type": "incorrect",
          "details": "Overamplification risks permanent sensor damage and false-positive readings."
        }
      ]
    },
    {
      "scenario": "Unexpected Energy Signature",
      "summary": "A spatial survey detects an intermittent energy signature with no apparent source or pattern.",
      "answers": [
        {
          "text": "Record the phenomenon and deploy a Class-II probe to gather localized readings.",
          "score": 9,
          "type": "best",
          "details": "Follows Starfleet scientific procedure for safe remote data collection."
        },
        {
          "text": "Adjust sensor modulation to enhance detection range and frequency discrimination.",
          "score": 8,
          "type": "alternate",
          "details": "Improves signal clarity while maintaining safe observational distance."
        },
        {
          "text": "Compare the readings to known subspace interference patterns from previous missions.",
          "score": 7,
          "type": "alternate",
          "details": "Provides useful context but does not directly verify the anomaly’s cause."
        },
        {
          "text": "Initiate direct energy scans without containment protocols.",
          "score": 3,
          "type": "incorrect",
          "details": "Risks feedback interference; unsafe without field dampeners in place."
        },
        {
          "text": "Attempt to match the frequency and emit a return pulse to 'communicate' with the anomaly.",
          "score": 0,
          "type": "incorrect",
          "details": "Speculative and hazardous; risks resonance or subspace rupture."
        }
      ]
    },
    {
      "scenario": "Warp Core Radiation Leak",
      "summary": "A trace radiation leak is detected near the warp core’s plasma conduit junctions.",
      "answers": [
        {
          "text": "Evacuate engineering staff, seal affected sections, and deploy containment fields.",
          "score": 9,
          "type": "best",
          "details": "Prioritizes crew safety and follows Starfleet emergency radiation protocols."
        },
        {
          "text": "Conduct a level-2 diagnostic to identify microfractures in the plasma conduits.",
          "score": 8,
          "type": "alternate",
          "details": "Efficient diagnostic approach that isolates potential structural issues safely."
        },
        {
          "text": "Deploy sensor drones to scan the core environment for radiation variance.",
          "score": 7,
          "type": "alternate",
          "details": "Effective remote scanning solution with minimal exposure risk."
        },
        {
          "text": "Increase ventilation flow to disperse radiation particles naturally.",
          "score": 3,
          "type": "incorrect",
          "details": "Ineffective and unsafe; dispersal spreads contamination instead of containing it."
        },
        {
          "text": "Bypass the containment alert system to avoid false positives until further notice.",
          "score": 0,
          "type": "incorrect",
          "details": "Violates Starfleet safety regulations; endangers crew and ship integrity."
        }
      ]
    }
  ]
}
