{
  "department": "Security",
  "exam": [
    {
      "scenario": "Intruder Alert",
      "summary": "Internal sensors detect an unauthorized life-form moving toward Main Engineering.",
      "answers": [
        {
          "text": "Seal all affected decks, dispatch two containment teams, and coordinate with internal sensors for live tracking.",
          "score": 9,
          "type": "best",
          "details": "Combines caution, coordination, and minimal risk to crew or ship systems."
        },
        {
          "text": "Send a single armed officer to intercept immediately.",
          "score": 0,
          "type": "incorrect",
          "details": "Overconfident approach that risks injury and loss of containment."
        },
        {
          "text": "Lock down Engineering only and await further movement before acting.",
          "score": 8,
          "type": "alternate",
          "details": "Containment-oriented but reactive; loses initiative if intruder redirects."
        }
      ]
    },
    {
      "scenario": "Weapon Discharge on Deck",
      "summary": "A phaser goes off in a crowded corridor, injuring a civilian technician.",
      "answers": [
        {
          "text": "Secure the weapon, assist medical personnel, and initiate a full forensic scan of the emitter.",
          "score": 9,
          "type": "best",
          "details": "Follows Starfleet investigative sequence while prioritizing safety."
        },
        {
          "text": "Question nearby witnesses immediately before medical aid arrives.",
          "score": 0,
          "type": "incorrect",
          "details": "Neglects primary duty to preserve life and scene safety."
        },
        {
          "text": "Evacuate civilians, seal the area, and delegate evidence collection to forensics.",
          "score": 8,
          "type": "alternate",
          "details": "Procedurally sound but delays immediate aid and identification of the shooter."
        }
      ]
    },
    {
      "scenario": "Suspicious Cargo",
      "summary": "Scans reveal a container emitting faint tritanium resonance not listed on the manifest.",
      "answers": [
        {
          "text": "Move the cargo to a secure bay, maintain environmental isolation, and perform a controlled scan.",
          "score": 9,
          "type": "best",
          "details": "Standard Starfleet hazardous-material containment protocol."
        },
        {
          "text": "Open the container carefully to identify contents firsthand.",
          "score": 0,
          "type": "incorrect",
          "details": "Bypasses containment procedure and endangers the inspection team."
        },
        {
          "text": "Request engineering to remotely analyze the container’s molecular composition.",
          "score": 8,
          "type": "alternate",
          "details": "Technically safe but delays action if the material is volatile."
        }
      ]
    },
    {
      "scenario": "Crew Confrontation",
      "summary": "Two officers escalate a personal dispute to physical aggression in a public area.",
      "answers": [
        {
          "text": "Separate the individuals, remove them from duty, and file an immediate incident report.",
          "score": 9,
          "type": "best",
          "details": "Restores order swiftly and preserves the integrity of the chain of command."
        },
        {
          "text": "Issue verbal warnings and order both officers back to their stations.",
          "score": 8,
          "type": "alternate",
          "details": "Quick resolution but lacks disciplinary follow-through; may invite repetition."
        },
        {
          "text": "Allow the argument to finish to identify the aggressor.",
          "score": 0,
          "type": "incorrect",
          "details": "Unacceptable lapse in containment; jeopardizes bystanders."
        }
      ]
    },
    {
      "scenario": "Security System Override",
      "summary": "A computer lockdown bypasses your access codes across all decks.",
      "answers": [
        {
          "text": "Initiate a manual isolation of security nodes and coordinate with engineering to trace the breach.",
          "score": 9,
          "type": "best",
          "details": "Integrates multidisciplinary response while maintaining compartmental integrity."
        },
        {
          "text": "Force a reboot of shipwide computer functions to restore control.",
          "score": 8,
          "type": "alternate",
          "details": "Potentially restores access but disrupts all ship systems mid-operation."
        },
        {
          "text": "Abandon computer systems and focus on physical patrols instead.",
          "score": 0,
          "type": "incorrect",
          "details": "Ignores digital threat source and compromises monitoring capacity."
        }
      ]
    },
    {
      "scenario": "Hostage Scenario",
      "summary": "An intruder traps civilians in a shuttle bay, demanding transport off the ship.",
      "answers": [
        {
          "text": "Establish communication, stall for time, and assemble a tactical team with full containment fields.",
          "score": 9,
          "type": "best",
          "details": "Prioritizes negotiation and minimizes casualties consistent with Federation law enforcement doctrine."
        },
        {
          "text": "Authorize a precision phaser strike to eliminate the threat immediately.",
          "score": 0,
          "type": "incorrect",
          "details": "Premature use of lethal force; violates Starfleet Rules of Engagement."
        },
        {
          "text": "Cut power to the shuttle bay and attempt an environmental knockout via anesthetic gas.",
          "score": 8,
          "type": "alternate",
          "details": "Viable non-lethal option though risky for hostages with medical vulnerabilities."
        }
      ]
    },
    {
      "scenario": "Sabotage Suspicion",
      "summary": "Critical systems fail after maintenance by a newly transferred crew member.",
      "answers": [
        {
          "text": "Secure the officer, restrict access privileges, and conduct a technical audit of recent work logs.",
          "score": 9,
          "type": "best",
          "details": "Balanced response preserving security and due process."
        },
        {
          "text": "Accuse the officer publicly to deter further sabotage.",
          "score": 0,
          "type": "incorrect",
          "details": "Destroys morale and violates investigative confidentiality."
        },
        {
          "text": "Increase security monitoring silently while gathering additional evidence.",
          "score": 8,
          "type": "alternate",
          "details": "Cautious and professional though slower to contain risk if sabotage is ongoing."
        }
      ]
    },
    {
      "scenario": "Alien Boarding Attempt",
      "summary": "Unknown vessels engage tractor beams and begin transporting boarding parties.",
      "answers": [
        {
          "text": "Raise shields, jam transport signatures, and coordinate with tactical for counter-transport protocols.",
          "score": 9,
          "type": "best",
          "details": "Demonstrates readiness and multi-system defense coordination."
        },
        {
          "text": "Target the attacking ships’ engines immediately to disable them.",
          "score": 8,
          "type": "alternate",
          "details": "Aggressive yet defensible; risk of escalation remains high."
        },
        {
          "text": "Evacuate lower decks and seal off the rest of the ship manually.",
          "score": 0,
          "type": "incorrect",
          "details": "Overly reactive; sacrifices control of strategic sections unnecessarily."
        }
      ]
    }
  ]
}
